using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;

namespace МашиностроительнаяБиблиотека
{
    public enum ОсновноеОтклонение
    {
        A, B, C, D, CD, E, F, FG, G, H, JS, K, M, N, P, R, S, T, U, V, X, Y, Z, ZA, ZB, ZC, J, EF,
        a, b, c, d, cd, e, f, fg, g, h, js, k, m, n, p, r, s, t, u, v, x, y, z, za, zb, zc, j, ef,
    };

    public static class ПоляДопусков
    {

        public static ПолеДопуска JS16 = new ПолеДопуска(ОсновноеОтклонение.JS, 16,
            new decimal[] { 3m, 6m, 10m, 14m, 18m, 24m, 30m, 40m, 50m, 65m, 80m, 100m, 120m, 140m, 160m, 180m, 200m, 225m, 250m, 280m, 315m, 355m, 400m, 450m, 500m },
            new decimal[] { 300m, 375m, 450m, 550m, 550m, 650m, 650m, 800m, 800m, 950m, 950m, 1100m, 1100m, 1250m, 1250m, 1250m, 1450m, 1450m, 1450m, 1600m, 1600m, 1800m, 1800m, 2000m, 2000m },
            new decimal[] { -300m, -375m, -450m, -550m, -550m, -650m, -650m, -800m, -800m, -950m, -950m, -1100m, -1100m, -1250m, -1250m, -1250m, -1450m, -1450m, -1450m, -1600m, -1600m, -1800m, -1800m, -2000m, -2000m }
            );

        public static ПолеДопуска P5 = new ПолеДопуска(ОсновноеОтклонение.P, 5,
        new decimal[] { 3m, 6m, 10m, 14m, 18m, 24m, 30m, 40m, 50m, 65m, 80m, 100m, 120m, 140m, 160m, 180m, 200m, 225m, 250m, 280m, 315m, 355m, 400m, 450m, 500m },
        new decimal[] { -6m, -11m, -13m, -15m, -15m, -19m, -19m, -22m, -22m, -27m, -27m, -32m, -32m, -37m, -37m, -37m, -44m, -44m, -44m, -49m, -49m, -55m, -55m, -61m, -61m },
        new decimal[] { -10m, -16m, -19m, -23m, -23m, -28m, -28m, -33m, -33m, -40m, -40m, -47m, -47m, -55m, -55m, -55m, -64m, -64m, -64m, -72m, -72m, -80m, -80m, -88m, -88m }
        );

        public static ПолеДопуска r6 = new ПолеДопуска(ОсновноеОтклонение.r, 6,
        new decimal[] { 3m, 6m, 10m, 14m, 18m, 24m, 30m, 40m, 50m, 65m, 80m, 100m, 120m, 140m, 160m, 180m, 200m, 225m, 250m, 280m, 315m, 355m, 400m, 450m, 500m, 560m },
        new decimal[] { 16m, 23m, 28m, 34m, 34m, 41m, 41m, 50m, 50m, 60m, 62m, 73m, 76m, 88m, 90m, 93m, 106m, 109m, 113m, 126m, 130m, 144m, 150m, 166m, 172m, 194m },
        new decimal[] { 10m, 15m, 19m, 23m, 23m, 28m, 28m, 34m, 34m, 41m, 43m, 51m, 54m, 63m, 65m, 68m, 77m, 80m, 84m, 94m, 98m, 108m, 114m, 126m, 132m, 150m }
        );

        public static ПолеДопуска k6 = new ПолеДопуска(ОсновноеОтклонение.k, 6,
        new decimal[] { 3m, 6m, 10m, 14m, 18m, 24m, 30m, 40m, 50m, 65m, 80m, 100m, 120m, 140m, 160m, 180m, 200m, 225m, 250m, 280m, 315m, 355m, 400m, 450m, 500m, 560m },
        new decimal[] { 6m, 9m, 10m, 12m, 12m, 15m, 15m, 18m, 18m, 21m, 21m, 25m, 25m, 28m, 28m, 28m, 33m, 33m, 33m, 36m, 36m, 40m, 40m, 45m, 45m, 44m },
        new decimal[] { 0m, 1m, 1m, 1m, 1m, 2m, 2m, 2m, 2m, 2m, 2m, 3m, 3m, 3m, 3m, 3m, 4m, 4m, 4m, 4m, 4m, 4m, 4m, 5m, 5m, 0m }
        );

        public static ПолеДопуска H14 = new ПолеДопуска(ОсновноеОтклонение.H, 14,
        new decimal[] { 3m, 6m, 10m, 14m, 18m, 24m, 30m, 40m, 50m, 65m, 80m, 100m, 120m, 140m, 160m, 180m, 200m, 225m, 250m, 280m, 315m, 355m, 400m, 450m, 500m },
        new decimal[] { 250m, 300m, 360m, 430m, 430m, 520m, 520m, 620m, 620m, 740m, 740m, 870m, 870m, 1000m, 1000m, 1000m, 1150m, 1150m, 1150m, 1300m, 1300m, 1400m, 1400m, 1550m, 1550m },
        new decimal[] { 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m }
        );

        public static ПолеДопуска H5 = new ПолеДопуска(ОсновноеОтклонение.H, 5,
        new decimal[] { 3m, 6m, 10m, 14m, 18m, 24m, 30m, 40m, 50m, 65m, 80m, 100m, 120m, 140m, 160m, 180m, 200m, 225m, 250m, 280m, 315m, 355m, 400m, 450m, 500m },
        new decimal[] { 4m, 5m, 6m, 8m, 8m, 9m, 9m, 11m, 11m, 13m, 13m, 15m, 15m, 18m, 18m, 18m, 20m, 20m, 20m, 23m, 23m, 25m, 25m, 27m, 27m },
        new decimal[] { 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m }
        );

        public static ПолеДопуска FG6 = new ПолеДопуска(ОсновноеОтклонение.FG, 6,
        new decimal[] { 3m, 6m, 10m },
        new decimal[] { 10m, 14m, 17m },
        new decimal[] { 4m, 6m, 8m }
        );

        public static ПолеДопуска K5 = new ПолеДопуска(ОсновноеОтклонение.K, 5,
        new decimal[] { 3m, 6m, 10m, 14m, 18m, 24m, 30m, 40m, 50m, 65m, 80m, 100m, 120m, 140m, 160m, 180m, 200m, 225m, 250m, 280m, 315m, 355m, 400m, 450m, 500m },
        new decimal[] { 0m, 0m, 1m, 2m, 2m, 1m, 1m, 2m, 2m, 3m, 3m, 2m, 2m, 3m, 3m, 3m, 2m, 2m, 2m, 3m, 3m, 3m, 3m, 2m, 2m },
        new decimal[] { -4m, -5m, -5m, -6m, -6m, -8m, -8m, -9m, -9m, -10m, -10m, -13m, -13m, -15m, -15m, -15m, -18m, -18m, -18m, -20m, -20m, -22m, -22m, -25m, -25m }
        );

        public static ПолеДопуска M5 = new ПолеДопуска(ОсновноеОтклонение.M, 5,
        new decimal[] { 3m, 6m, 10m, 14m, 18m, 24m, 30m, 40m, 50m, 65m, 80m, 100m, 120m, 140m, 160m, 180m, 200m, 225m, 250m, 280m, 315m, 355m, 400m, 450m, 500m },
        new decimal[] { -2m, -3m, -4m, -4m, -4m, -5m, -5m, -5m, -5m, -6m, -6m, -8m, -8m, -9m, -9m, -9m, -11m, -11m, -11m, -13m, -13m, -14m, -14m, -16m, -16m },
        new decimal[] { -6m, -8m, -10m, -12m, -12m, -14m, -14m, -16m, -16m, -19m, -19m, -23m, -23m, -27m, -27m, -27m, -31m, -31m, -31m, -36m, -36m, -39m, -39m, -43m, -43m }
        );

        public static ПолеДопуска N5 = new ПолеДопуска(ОсновноеОтклонение.N, 5,
        new decimal[] { 3m, 6m, 10m, 14m, 18m, 24m, 30m, 40m, 50m, 65m, 80m, 100m, 120m, 140m, 160m, 180m, 200m, 225m, 250m, 280m, 315m, 355m, 400m, 450m, 500m },
        new decimal[] { -4m, -7m, -8m, -9m, -9m, -12m, -12m, -13m, -13m, -15m, -15m, -18m, -18m, -21m, -21m, -21m, -25m, -25m, -25m, -27m, -27m, -30m, -30m, -33m, -33m },
        new decimal[] { -8m, -12m, -14m, -17m, -17m, -21m, -21m, -24m, -24m, -28m, -28m, -33m, -33m, -39m, -39m, -39m, -45m, -45m, -45m, -50m, -50m, -55m, -55m, -60m, -60m }
        );

        public static ПолеДопуска h4 = new ПолеДопуска(ОсновноеОтклонение.h, 4,
        new decimal[] { 3m, 6m, 10m, 14m, 18m, 24m, 30m, 40m, 50m, 65m, 80m, 100m, 120m, 140m, 160m, 180m, 200m, 225m, 250m, 280m, 315m, 355m, 400m, 450m, 500m, 560m },
        new decimal[] { 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m },
        new decimal[] { -3m, -4m, -4m, -5m, -5m, -6m, -6m, -7m, -7m, -8m, -8m, -10m, -10m, -12m, -12m, -12m, -14m, -14m, -14m, -16m, -16m, -18m, -18m, -20m, -20m, -22m }
        );

        public static ПолеДопуска A11 = new ПолеДопуска(ОсновноеОтклонение.A, 11,
        new decimal[] { 3m, 6m, 10m, 14m, 18m, 24m, 30m, 40m, 50m, 65m, 80m, 100m, 120m, 140m, 160m, 180m, 200m, 225m, 250m, 280m, 315m, 355m, 400m, 450m, 500m },
        new decimal[] { 330m, 345m, 370m, 400m, 400m, 430m, 430m, 470m, 480m, 530m, 550m, 600m, 630m, 710m, 770m, 830m, 950m, 1030m, 1110m, 1240m, 1370m, 1560m, 1710m, 1900m, 2050m },
        new decimal[] { 270m, 270m, 280m, 290m, 290m, 300m, 300m, 310m, 320m, 340m, 360m, 380m, 410m, 460m, 520m, 580m, 660m, 740m, 820m, 920m, 1050m, 1200m, 1350m, 1500m, 1650m }
        );

        public static ПолеДопуска k4 = new ПолеДопуска(ОсновноеОтклонение.k, 4,
        new decimal[] { 3m, 6m, 10m, 14m, 18m, 24m, 30m, 40m, 50m, 65m, 80m, 100m, 120m, 140m, 160m, 180m, 200m, 225m, 250m, 280m, 315m, 355m, 400m, 450m, 500m, 560m },
        new decimal[] { 3m, 5m, 5m, 6m, 6m, 8m, 8m, 9m, 9m, 10m, 10m, 13m, 13m, 15m, 15m, 15m, 18m, 18m, 18m, 20m, 20m, 22m, 22m, 25m, 25m, 22m },
        new decimal[] { 0m, 1m, 1m, 1m, 1m, 2m, 2m, 2m, 2m, 2m, 2m, 3m, 3m, 3m, 3m, 3m, 4m, 4m, 4m, 4m, 4m, 4m, 4m, 5m, 5m, 0m }
        );

        public static ПолеДопуска z6 = new ПолеДопуска(ОсновноеОтклонение.z, 6,
        new decimal[] { 3m, 6m, 10m, 14m, 18m, 24m, 30m, 40m, 50m, 65m, 80m, 100m, 120m, 140m, 160m, 180m, 200m, 225m, 250m, 280m, 315m, 355m, 400m, 450m, 500m },
        new decimal[] { 32m, 43m, 51m, 61m, 71m, 86m, 101m, 128m, 152m, 191m, 229m, 280m, 332m, 390m, 440m, 490m, 549m, 604m, 669m, 742m, 822m, 936m, 1036m, 1140m, 1290m },
        new decimal[] { 26m, 35m, 42m, 50m, 60m, 73m, 88m, 112m, 136m, 172m, 210m, 258m, 310m, 365m, 415m, 465m, 520m, 575m, 640m, 710m, 790m, 900m, 1000m, 1100m, 1250m }
        );

        public static ПолеДопуска E5 = new ПолеДопуска(ОсновноеОтклонение.E, 5,
        new decimal[] { 3m, 6m, 10m, 14m, 18m, 24m, 30m, 40m, 50m, 65m, 80m, 100m, 120m, 140m, 160m, 180m, 200m, 225m, 250m, 280m, 315m, 355m, 400m, 450m, 500m },
        new decimal[] { 18m, 25m, 31m, 40m, 40m, 49m, 49m, 61m, 61m, 73m, 73m, 87m, 87m, 103m, 103m, 103m, 120m, 120m, 120m, 133m, 133m, 150m, 150m, 162m, 162m },
        new decimal[] { 14m, 20m, 25m, 32m, 32m, 40m, 40m, 50m, 50m, 60m, 60m, 72m, 72m, 85m, 85m, 85m, 100m, 100m, 100m, 110m, 110m, 125m, 125m, 135m, 135m }
        );

        public static ПолеДопуска F5 = new ПолеДопуска(ОсновноеОтклонение.F, 5,
        new decimal[] { 3m, 6m, 10m, 14m, 18m, 24m, 30m, 40m, 50m, 65m, 80m, 100m, 120m, 140m, 160m, 180m, 200m, 225m, 250m, 280m, 315m, 355m, 400m, 450m, 500m },
        new decimal[] { 10m, 15m, 19m, 24m, 24m, 29m, 29m, 36m, 36m, 43m, 43m, 51m, 51m, 61m, 61m, 61m, 70m, 70m, 70m, 79m, 79m, 87m, 87m, 95m, 95m },
        new decimal[] { 6m, 10m, 13m, 16m, 16m, 20m, 20m, 25m, 25m, 30m, 30m, 36m, 36m, 43m, 43m, 43m, 50m, 50m, 50m, 56m, 56m, 62m, 62m, 68m, 68m }
        );

        public static ПолеДопуска G5 = new ПолеДопуска(ОсновноеОтклонение.G, 5,
        new decimal[] { 3m, 6m, 10m, 14m, 18m, 24m, 30m, 40m, 50m, 65m, 80m, 100m, 120m, 140m, 160m, 180m, 200m, 225m, 250m, 280m, 315m, 355m, 400m, 450m, 500m },
        new decimal[] { 6m, 9m, 11m, 14m, 14m, 16m, 16m, 20m, 20m, 23m, 23m, 27m, 27m, 32m, 32m, 32m, 35m, 35m, 35m, 40m, 40m, 43m, 43m, 47m, 47m },
        new decimal[] { 2m, 4m, 5m, 6m, 6m, 7m, 7m, 9m, 9m, 10m, 10m, 12m, 12m, 14m, 14m, 14m, 15m, 15m, 15m, 17m, 17m, 18m, 18m, 20m, 20m }
        );

        public static ПолеДопуска P6 = new ПолеДопуска(ОсновноеОтклонение.P, 6,
        new decimal[] { 3m, 6m, 10m, 14m, 18m, 24m, 30m, 40m, 50m, 65m, 80m, 100m, 120m, 140m, 160m, 180m, 200m, 225m, 250m, 280m, 315m, 355m, 400m, 450m, 500m },
        new decimal[] { -6m, -9m, -12m, -15m, -15m, -18m, -18m, -21m, -21m, -26m, -26m, -30m, -30m, -36m, -36m, -36m, -41m, -41m, -41m, -47m, -47m, -51m, -51m, -55m, -55m },
        new decimal[] { -12m, -17m, -21m, -26m, -26m, -31m, -31m, -37m, -37m, -45m, -45m, -52m, -52m, -61m, -61m, -61m, -70m, -70m, -70m, -79m, -79m, -87m, -87m, -95m, -95m }
        );

        public static ПолеДопуска H11 = new ПолеДопуска(ОсновноеОтклонение.H, 11,
        new decimal[] { 3m, 6m, 10m, 14m, 18m, 24m, 30m, 40m, 50m, 65m, 80m, 100m, 120m, 140m, 160m, 180m, 200m, 225m, 250m, 280m, 315m, 355m, 400m, 450m, 500m },
        new decimal[] { 60m, 75m, 90m, 110m, 110m, 130m, 130m, 160m, 160m, 190m, 190m, 220m, 220m, 250m, 250m, 250m, 290m, 290m, 290m, 320m, 320m, 360m, 360m, 400m, 400m },
        new decimal[] { 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m }
        );

        public static ПолеДопуска R6 = new ПолеДопуска(ОсновноеОтклонение.R, 6,
        new decimal[] { 3m, 6m, 10m, 14m, 18m, 24m, 30m, 40m, 50m, 65m, 80m, 100m, 120m, 140m, 160m, 180m, 200m, 225m, 250m, 280m, 315m, 355m, 400m, 450m, 500m },
        new decimal[] { -10m, -12m, -16m, -20m, -20m, -24m, -24m, -29m, -29m, -35m, -37m, -44m, -47m, -56m, -58m, -61m, -68m, -71m, -75m, -85m, -89m, -97m, -103m, -113m, -119m },
        new decimal[] { -16m, -20m, -25m, -31m, -31m, -37m, -37m, -45m, -45m, -54m, -56m, -66m, -69m, -81m, -83m, -86m, -97m, -100m, -104m, -117m, -121m, -133m, -139m, -153m, -159m }
        );

        public static ПолеДопуска S6 = new ПолеДопуска(ОсновноеОтклонение.S, 6,
        new decimal[] { 3m, 6m, 10m, 14m, 18m, 24m, 30m, 40m, 50m, 65m, 80m, 100m, 120m, 140m, 160m, 180m, 200m, 225m, 250m, 280m, 315m, 355m, 400m, 450m, 500m },
        new decimal[] { -14m, -16m, -20m, -25m, -25m, -31m, -31m, -38m, -38m, -47m, -53m, -64m, -72m, -85m, -93m, -101m, -113m, -121m, -131m, -149m, -161m, -179m, -197m, -219m, -239m },
        new decimal[] { -20m, -24m, -29m, -36m, -36m, -44m, -44m, -54m, -54m, -66m, -72m, -86m, -94m, -110m, -118m, -126m, -142m, -150m, -160m, -181m, -193m, -215m, -233m, -259m, -279m }
        );

        /*public static ПолеДопуска EF6 = new ПолеДопуска(ОсновноеОтклонение.EF, 6,
        new decimal[] { 3m, 6m, 10m },
        new decimal[] { 16m, 22m, 27m },
        new decimal[] { 10m, 14m, 18m }
        );*/

        public static ПолеДопуска t5 = new ПолеДопуска(ОсновноеОтклонение.t, 5,
        new decimal[] { 3m, 6m, 10m, 14m, 18m, 24m, 30m, 40m, 50m, 65m, 80m, 100m, 120m, 140m, 160m, 180m, 200m, 225m, 250m, 280m, 315m, 355m, 400m, 450m, 500m, 560m },
        new decimal[] { 0m, 0m, 0m, 0m, 0m, 0m, 50m, 59m, 65m, 79m, 88m, 106m, 119m, 140m, 152m, 164m, 186m, 200m, 216m, 241m, 263m, 293m, 319m, 357m, 387m, 430m },
        new decimal[] { 0m, 0m, 0m, 0m, 0m, 0m, 41m, 48m, 54m, 66m, 75m, 91m, 104m, 122m, 134m, 146m, 166m, 180m, 196m, 218m, 240m, 268m, 294m, 330m, 360m, 400m }
        );

        public static ПолеДопуска f4 = new ПолеДопуска(ОсновноеОтклонение.f, 4,
        new decimal[] { 3m, 6m, 10m, 14m, 18m, 24m, 30m, 40m, 50m, 65m, 80m, 100m, 120m, 140m, 160m, 180m, 200m, 225m, 250m, 280m, 315m, 355m, 400m, 450m, 500m, 560m },
        new decimal[] { -6m, -10m, -13m, -16m, -16m, -20m, -20m, -25m, -25m, -30m, -30m, -36m, -36m, -43m, -43m, -43m, -50m, -50m, -50m, -56m, -56m, -62m, -62m, -68m, -68m, -76m },
        new decimal[] { -9m, -14m, -17m, -21m, -21m, -26m, -26m, -32m, -32m, -38m, -38m, -46m, -46m, -55m, -55m, -55m, -64m, -64m, -64m, -72m, -72m, -80m, -80m, -88m, -88m, -98m }
        );

        public static ПолеДопуска g4 = new ПолеДопуска(ОсновноеОтклонение.g, 4,
        new decimal[] { 3m, 6m, 10m, 14m, 18m, 24m, 30m, 40m, 50m, 65m, 80m, 100m, 120m, 140m, 160m, 180m, 200m, 225m, 250m, 280m, 315m, 355m, 400m, 450m, 500m, 560m },
        new decimal[] { -2m, -4m, -5m, -6m, -6m, -7m, -7m, -9m, -9m, -10m, -10m, -12m, -12m, -14m, -14m, -14m, -15m, -15m, -15m, -17m, -17m, -18m, -18m, -20m, -20m, -22m },
        new decimal[] { -5m, -8m, -9m, -11m, -11m, -13m, -13m, -16m, -16m, -18m, -18m, -22m, -22m, -26m, -26m, -26m, -29m, -29m, -29m, -33m, -33m, -36m, -36m, -40m, -40m, -44m }
        );

        public static ПолеДопуска H6 = new ПолеДопуска(ОсновноеОтклонение.H, 6,
        new decimal[] { 3m, 6m, 10m, 14m, 18m, 24m, 30m, 40m, 50m, 65m, 80m, 100m, 120m, 140m, 160m, 180m, 200m, 225m, 250m, 280m, 315m, 355m, 400m, 450m, 500m },
        new decimal[] { 6m, 8m, 9m, 11m, 11m, 13m, 13m, 16m, 16m, 19m, 19m, 22m, 22m, 25m, 25m, 25m, 29m, 29m, 29m, 32m, 32m, 36m, 36m, 40m, 40m },
        new decimal[] { 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m }
        );

        public static ПолеДопуска D7 = new ПолеДопуска(ОсновноеОтклонение.D, 7,
        new decimal[] { 3m, 6m, 10m, 14m, 18m, 24m, 30m, 40m, 50m, 65m, 80m, 100m, 120m, 140m, 160m, 180m, 200m, 225m, 250m, 280m, 315m, 355m, 400m, 450m, 500m },
        new decimal[] { 30m, 42m, 55m, 68m, 68m, 86m, 86m, 105m, 105m, 130m, 130m, 155m, 155m, 185m, 185m, 185m, 216m, 216m, 216m, 242m, 242m, 267m, 267m, 293m, 293m },
        new decimal[] { 20m, 30m, 40m, 50m, 50m, 65m, 65m, 80m, 80m, 100m, 100m, 120m, 120m, 145m, 145m, 145m, 170m, 170m, 170m, 190m, 190m, 210m, 210m, 230m, 230m }
        );

        public static ПолеДопуска J6 = new ПолеДопуска(ОсновноеОтклонение.J, 6,
        new decimal[] { 3m, 6m, 10m, 14m, 18m, 24m, 30m, 40m, 50m, 65m, 80m, 100m, 120m, 140m, 160m, 180m, 200m, 225m, 250m, 280m, 315m, 355m, 400m, 450m, 500m },
        new decimal[] { 2m, 5m, 5m, 6m, 6m, 8m, 8m, 10m, 10m, 13m, 13m, 16m, 16m, 18m, 18m, 18m, 22m, 22m, 22m, 25m, 25m, 29m, 29m, 33m, 33m },
        new decimal[] { -4m, -3m, -4m, -5m, -5m, -5m, -5m, -6m, -6m, -6m, -6m, -6m, -6m, -7m, -7m, -7m, -7m, -7m, -7m, -7m, -7m, -7m, -7m, -7m, -7m }
        );

        public static ПолеДопуска K6 = new ПолеДопуска(ОсновноеОтклонение.K, 6,
        new decimal[] { 3m, 6m, 10m, 14m, 18m, 24m, 30m, 40m, 50m, 65m, 80m, 100m, 120m, 140m, 160m, 180m, 200m, 225m, 250m, 280m, 315m, 355m, 400m, 450m, 500m },
        new decimal[] { 0m, 2m, 2m, 2m, 2m, 2m, 2m, 3m, 3m, 4m, 4m, 4m, 4m, 4m, 4m, 4m, 5m, 5m, 5m, 5m, 5m, 7m, 7m, 8m, 8m },
        new decimal[] { -6m, -6m, -7m, -9m, -9m, -11m, -11m, -13m, -13m, -15m, -15m, -18m, -18m, -21m, -21m, -21m, -24m, -24m, -24m, -27m, -27m, -29m, -29m, -32m, -32m }
        );

        public static ПолеДопуска C11 = new ПолеДопуска(ОсновноеОтклонение.C, 11,
        new decimal[] { 3m, 6m, 10m, 14m, 18m, 24m, 30m, 40m, 50m, 65m, 80m, 100m, 120m, 140m, 160m, 180m, 200m, 225m, 250m, 280m, 315m, 355m, 400m, 450m, 500m },
        new decimal[] { 120m, 145m, 170m, 205m, 205m, 240m, 240m, 280m, 290m, 330m, 340m, 390m, 400m, 450m, 460m, 480m, 530m, 550m, 570m, 620m, 650m, 720m, 760m, 840m, 880m },
        new decimal[] { 60m, 70m, 80m, 95m, 95m, 110m, 110m, 120m, 130m, 140m, 150m, 170m, 180m, 200m, 210m, 230m, 240m, 260m, 280m, 300m, 330m, 360m, 400m, 440m, 480m }
        );

        public static ПолеДопуска M6 = new ПолеДопуска(ОсновноеОтклонение.M, 6,
        new decimal[] { 3m, 6m, 10m, 14m, 18m, 24m, 30m, 40m, 50m, 65m, 80m, 100m, 120m, 140m, 160m, 180m, 200m, 225m, 250m, 280m, 315m, 355m, 400m, 450m, 500m },
        new decimal[] { -2m, -1m, -3m, -4m, -4m, -4m, -4m, -4m, -4m, -5m, -5m, -6m, -6m, -8m, -8m, -8m, -8m, -8m, -8m, -9m, -9m, -10m, -10m, -10m, -10m },
        new decimal[] { -8m, -9m, -12m, -15m, -15m, -17m, -17m, -20m, -20m, -24m, -24m, -28m, -28m, -33m, -33m, -33m, -37m, -37m, -37m, -41m, -41m, -46m, -46m, -50m, -50m }
        );

        public static ПолеДопуска N6 = new ПолеДопуска(ОсновноеОтклонение.N, 6,
        new decimal[] { 3m, 6m, 10m, 14m, 18m, 24m, 30m, 40m, 50m, 65m, 80m, 100m, 120m, 140m, 160m, 180m, 200m, 225m, 250m, 280m, 315m, 355m, 400m, 450m, 500m },
        new decimal[] { -4m, -5m, -7m, -9m, -9m, -11m, -11m, -12m, -12m, -14m, -14m, -16m, -16m, -20m, -20m, -20m, -22m, -22m, -22m, -25m, -25m, -26m, -26m, -27m, -27m },
        new decimal[] { -10m, -13m, -16m, -20m, -20m, -24m, -24m, -28m, -28m, -33m, -33m, -38m, -38m, -45m, -45m, -45m, -51m, -51m, -51m, -57m, -57m, -62m, -62m, -67m, -67m }
        );

        public static ПолеДопуска h14 = new ПолеДопуска(ОсновноеОтклонение.h, 14,
        new decimal[] { 3m, 6m, 10m, 14m, 18m, 24m, 30m, 40m, 50m, 65m, 80m, 100m, 120m, 140m, 160m, 180m, 200m, 225m, 250m, 280m, 315m, 355m, 400m, 450m, 500m, 560m },
        new decimal[] { 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m },
        new decimal[] { -250m, -300m, -360m, -430m, -430m, -520m, -520m, -620m, -620m, -740m, -740m, -870m, -870m, -1000m, -1000m, -1000m, -1150m, -1150m, -1150m, -1300m, -1300m, -1400m, -1400m, -1550m, -1550m, -1750m }
        );

        public static ПолеДопуска h5 = new ПолеДопуска(ОсновноеОтклонение.h, 5,
        new decimal[] { 3m, 6m, 10m, 14m, 18m, 24m, 30m, 40m, 50m, 65m, 80m, 100m, 120m, 140m, 160m, 180m, 200m, 225m, 250m, 280m, 315m, 355m, 400m, 450m, 500m, 560m },
        new decimal[] { 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m },
        new decimal[] { -4m, -5m, -6m, -8m, -8m, -9m, -9m, -11m, -11m, -13m, -13m, -15m, -15m, -18m, -18m, -18m, -20m, -20m, -20m, -23m, -23m, -25m, -25m, -27m, -27m, -30m }
        );

        public static ПолеДопуска j5 = new ПолеДопуска(ОсновноеОтклонение.j, 5,
        new decimal[] { 3m, 6m, 10m, 14m, 18m, 24m, 30m, 40m, 50m, 65m, 80m, 100m, 120m, 140m, 160m, 180m, 200m, 225m, 250m, 280m, 315m, 355m, 400m, 450m, 500m, 560m },
        new decimal[] { 2m, 3m, 4m, 5m, 5m, 5m, 5m, 6m, 6m, 6m, 6m, 6m, 6m, 7m, 7m, 7m, 7m, 7m, 7m, 7m, 7m, 7m, 7m, 7m, 7m, 7m },
        new decimal[] { -2m, -2m, -2m, -3m, -3m, -4m, -4m, -5m, -5m, -7m, -7m, -9m, -9m, -11m, -11m, -11m, -13m, -13m, -13m, -16m, -16m, -18m, -18m, -20m, -20m, -20m }
        );

        public static ПолеДопуска k5 = new ПолеДопуска(ОсновноеОтклонение.k, 5,
        new decimal[] { 3m, 6m, 10m, 14m, 18m, 24m, 30m, 40m, 50m, 65m, 80m, 100m, 120m, 140m, 160m, 180m, 200m, 225m, 250m, 280m, 315m, 355m, 400m, 450m, 500m, 560m },
        new decimal[] { 4m, 6m, 7m, 9m, 9m, 11m, 11m, 13m, 13m, 15m, 15m, 18m, 18m, 21m, 21m, 21m, 24m, 24m, 24m, 27m, 27m, 29m, 29m, 32m, 32m, 30m },
        new decimal[] { 0m, 1m, 1m, 1m, 1m, 2m, 2m, 2m, 2m, 2m, 2m, 3m, 3m, 3m, 3m, 3m, 4m, 4m, 4m, 4m, 4m, 4m, 4m, 5m, 5m, 0m }
        );

        public static ПолеДопуска D6 = new ПолеДопуска(ОсновноеОтклонение.D, 6,
        new decimal[] { 3m, 6m, 10m, 14m, 18m, 24m, 30m, 40m, 50m, 65m, 80m, 100m, 120m, 140m, 160m, 180m, 200m, 225m, 250m, 280m, 315m, 355m, 400m, 450m, 500m },
        new decimal[] { 26m, 38m, 49m, 61m, 61m, 78m, 78m, 96m, 96m, 119m, 119m, 142m, 142m, 170m, 170m, 170m, 199m, 199m, 199m, 222m, 222m, 246m, 246m, 270m, 270m },
        new decimal[] { 20m, 30m, 40m, 50m, 50m, 65m, 65m, 80m, 80m, 100m, 100m, 120m, 120m, 145m, 145m, 145m, 170m, 170m, 170m, 190m, 190m, 210m, 210m, 230m, 230m }
        );

        public static ПолеДопуска E6 = new ПолеДопуска(ОсновноеОтклонение.E, 6,
        new decimal[] { 3m, 6m, 10m, 14m, 18m, 24m, 30m, 40m, 50m, 65m, 80m, 100m, 120m, 140m, 160m, 180m, 200m, 225m, 250m, 280m, 315m, 355m, 400m, 450m, 500m },
        new decimal[] { 20m, 28m, 34m, 43m, 43m, 53m, 53m, 66m, 66m, 79m, 79m, 94m, 94m, 110m, 110m, 110m, 129m, 129m, 129m, 142m, 142m, 161m, 161m, 175m, 175m },
        new decimal[] { 14m, 20m, 25m, 32m, 32m, 40m, 40m, 50m, 50m, 60m, 60m, 72m, 72m, 85m, 85m, 85m, 100m, 100m, 100m, 110m, 110m, 125m, 125m, 135m, 135m }
        );

        public static ПолеДопуска F6 = new ПолеДопуска(ОсновноеОтклонение.F, 6,
        new decimal[] { 3m, 6m, 10m, 14m, 18m, 24m, 30m, 40m, 50m, 65m, 80m, 100m, 120m, 140m, 160m, 180m, 200m, 225m, 250m, 280m, 315m, 355m, 400m, 450m, 500m },
        new decimal[] { 12m, 18m, 22m, 27m, 27m, 33m, 33m, 41m, 41m, 49m, 49m, 58m, 58m, 68m, 68m, 68m, 79m, 79m, 79m, 88m, 88m, 98m, 98m, 108m, 108m },
        new decimal[] { 6m, 10m, 13m, 16m, 16m, 20m, 20m, 25m, 25m, 30m, 30m, 36m, 36m, 43m, 43m, 43m, 50m, 50m, 50m, 56m, 56m, 62m, 62m, 68m, 68m }
        );

        public static ПолеДопуска G6 = new ПолеДопуска(ОсновноеОтклонение.G, 6,
        new decimal[] { 3m, 6m, 10m, 14m, 18m, 24m, 30m, 40m, 50m, 65m, 80m, 100m, 120m, 140m, 160m, 180m, 200m, 225m, 250m, 280m, 315m, 355m, 400m, 450m, 500m },
        new decimal[] { 8m, 12m, 14m, 17m, 17m, 20m, 20m, 25m, 25m, 29m, 29m, 34m, 34m, 39m, 39m, 39m, 44m, 44m, 44m, 49m, 49m, 54m, 54m, 60m, 60m },
        new decimal[] { 2m, 4m, 5m, 6m, 6m, 7m, 7m, 9m, 9m, 10m, 10m, 12m, 12m, 14m, 14m, 14m, 15m, 15m, 15m, 17m, 17m, 18m, 18m, 20m, 20m }
        );

        public static ПолеДопуска P7 = new ПолеДопуска(ОсновноеОтклонение.P, 7,
        new decimal[] { 3m, 6m, 10m, 14m, 18m, 24m, 30m, 40m, 50m, 65m, 80m, 100m, 120m, 140m, 160m, 180m, 200m, 225m, 250m, 280m, 315m, 355m, 400m, 450m, 500m },
        new decimal[] { -6m, -8m, -9m, -11m, -11m, -14m, -14m, -17m, -17m, -21m, -21m, -24m, -24m, -28m, -28m, -28m, -33m, -33m, -33m, -36m, -36m, -41m, -41m, -45m, -45m },
        new decimal[] { -16m, -20m, -24m, -29m, -29m, -35m, -35m, -42m, -42m, -51m, -51m, -59m, -59m, -68m, -68m, -68m, -79m, -79m, -79m, -88m, -88m, -98m, -98m, -108m, -108m }
        );

        public static ПолеДопуска R7 = new ПолеДопуска(ОсновноеОтклонение.R, 7,
        new decimal[] { 3m, 6m, 10m, 14m, 18m, 24m, 30m, 40m, 50m, 65m, 80m, 100m, 120m, 140m, 160m, 180m, 200m, 225m, 250m, 280m, 315m, 355m, 400m, 450m, 500m },
        new decimal[] { -10m, -11m, -13m, -16m, -16m, -20m, -20m, -25m, -25m, -30m, -32m, -38m, -41m, -48m, -50m, -53m, -60m, -63m, -67m, -74m, -78m, -87m, -93m, -103m, -109m },
        new decimal[] { -20m, -23m, -28m, -34m, -34m, -41m, -41m, -50m, -50m, -60m, -62m, -73m, -76m, -88m, -90m, -93m, -106m, -109m, -113m, -126m, -130m, -144m, -150m, -166m, -172m }
        );

        public static ПолеДопуска S7 = new ПолеДопуска(ОсновноеОтклонение.S, 7,
        new decimal[] { 3m, 6m, 10m, 14m, 18m, 24m, 30m, 40m, 50m, 65m, 80m, 100m, 120m, 140m, 160m, 180m, 200m, 225m, 250m, 280m, 315m, 355m, 400m, 450m, 500m },
        new decimal[] { -14m, -15m, -17m, -21m, -21m, -27m, -27m, -34m, -34m, -42m, -48m, -58m, -66m, -77m, -85m, -93m, -105m, -113m, -123m, -138m, -150m, -169m, -187m, -209m, -229m },
        new decimal[] { -24m, -27m, -32m, -39m, -39m, -48m, -48m, -59m, -59m, -72m, -78m, -93m, -101m, -117m, -125m, -133m, -151m, -159m, -169m, -190m, -202m, -226m, -244m, -272m, -292m }
        );

        public static ПолеДопуска T7 = new ПолеДопуска(ОсновноеОтклонение.T, 7,
        new decimal[] { 3m, 6m, 10m, 14m, 18m, 24m, 30m, 40m, 50m, 65m, 80m, 100m, 120m, 140m, 160m, 180m, 200m, 225m, 250m, 280m, 315m, 355m, 400m, 450m, 500m },
        new decimal[] { 0m, 0m, 0m, 0m, 0m, 0m, -33m, -39m, -45m, -55m, -64m, -78m, -91m, -107m, -119m, -131m, -149m, -163m, -179m, -198m, -220m, -247m, -273m, -307m, -337m },
        new decimal[] { 0m, 0m, 0m, 0m, 0m, 0m, -54m, -64m, -70m, -85m, -94m, -113m, -126m, -147m, -159m, -171m, -195m, -209m, -225m, -250m, -272m, -304m, -330m, -370m, -400m }
        );

        public static ПолеДопуска e5 = new ПолеДопуска(ОсновноеОтклонение.e, 5,
        new decimal[] { 3m, 6m, 10m, 14m, 18m, 24m, 30m, 40m, 50m, 65m, 80m, 100m, 120m, 140m, 160m, 180m, 200m, 225m, 250m, 280m, 315m, 355m, 400m, 450m, 500m, 560m },
        new decimal[] { -14m, -20m, -25m, -32m, -32m, -40m, -40m, -50m, -50m, -60m, -60m, -72m, -72m, -85m, -85m, -85m, -100m, -100m, -100m, -110m, -110m, -125m, -125m, -135m, -135m, -145m },
        new decimal[] { -18m, -25m, -31m, -40m, -40m, -49m, -49m, -61m, -61m, -73m, -73m, -87m, -87m, -103m, -103m, -103m, -120m, -120m, -120m, -133m, -133m, -150m, -150m, -162m, -162m, -175m }
        );

        public static ПолеДопуска f5 = new ПолеДопуска(ОсновноеОтклонение.f, 5,
        new decimal[] { 3m, 6m, 10m, 14m, 18m, 24m, 30m, 40m, 50m, 65m, 80m, 100m, 120m, 140m, 160m, 180m, 200m, 225m, 250m, 280m, 315m, 355m, 400m, 450m, 500m, 560m },
        new decimal[] { -6m, -10m, -13m, -16m, -16m, -20m, -20m, -25m, -25m, -30m, -30m, -36m, -36m, -43m, -43m, -43m, -50m, -50m, -50m, -56m, -56m, -62m, -62m, -68m, -68m, -76m },
        new decimal[] { -10m, -15m, -19m, -24m, -24m, -29m, -29m, -36m, -36m, -43m, -43m, -51m, -51m, -61m, -61m, -61m, -70m, -70m, -70m, -79m, -79m, -87m, -87m, -95m, -95m, -106m }
        );

        public static ПолеДопуска g5 = new ПолеДопуска(ОсновноеОтклонение.g, 5,
        new decimal[] { 3m, 6m, 10m, 14m, 18m, 24m, 30m, 40m, 50m, 65m, 80m, 100m, 120m, 140m, 160m, 180m, 200m, 225m, 250m, 280m, 315m, 355m, 400m, 450m, 500m, 560m },
        new decimal[] { -2m, -4m, -5m, -6m, -6m, -7m, -7m, -9m, -9m, -10m, -10m, -12m, -12m, -14m, -14m, -14m, -15m, -15m, -15m, -17m, -17m, -18m, -18m, -20m, -20m, -22m },
        new decimal[] { -6m, -9m, -11m, -14m, -14m, -16m, -16m, -20m, -20m, -23m, -23m, -27m, -27m, -32m, -32m, -32m, -35m, -35m, -35m, -40m, -40m, -43m, -43m, -47m, -47m, -52m }
        );

        public static ПолеДопуска H7 = new ПолеДопуска(ОсновноеОтклонение.H, 7,
        new decimal[] { 3m, 6m, 10m, 14m, 18m, 24m, 30m, 40m, 50m, 65m, 80m, 100m, 120m, 140m, 160m, 180m, 200m, 225m, 250m, 280m, 315m, 355m, 400m, 450m, 500m },
        new decimal[] { 10m, 12m, 15m, 18m, 18m, 21m, 21m, 25m, 25m, 30m, 30m, 35m, 35m, 40m, 40m, 40m, 46m, 46m, 46m, 52m, 52m, 57m, 57m, 63m, 63m },
        new decimal[] { 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m }
        );

        public static ПолеДопуска h11 = new ПолеДопуска(ОсновноеОтклонение.h, 11,
        new decimal[] { 3m, 6m, 10m, 14m, 18m, 24m, 30m, 40m, 50m, 65m, 80m, 100m, 120m, 140m, 160m, 180m, 200m, 225m, 250m, 280m, 315m, 355m, 400m, 450m, 500m, 560m },
        new decimal[] { 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m },
        new decimal[] { -60m, -75m, -90m, -110m, -110m, -130m, -130m, -160m, -160m, -190m, -190m, -220m, -220m, -250m, -250m, -250m, -290m, -290m, -290m, -320m, -320m, -360m, -360m, -400m, -400m, -440m }
        );

        public static ПолеДопуска J7 = new ПолеДопуска(ОсновноеОтклонение.J, 7,
        new decimal[] { 3m, 6m, 10m, 14m, 18m, 24m, 30m, 40m, 50m, 65m, 80m, 100m, 120m, 140m, 160m, 180m, 200m, 225m, 250m, 280m, 315m, 355m, 400m, 450m, 500m },
        new decimal[] { 4m, 6m, 8m, 10m, 10m, 12m, 12m, 14m, 14m, 18m, 18m, 22m, 22m, 26m, 26m, 26m, 30m, 30m, 30m, 36m, 36m, 39m, 39m, 43m, 43m },
        new decimal[] { -6m, -6m, -7m, -8m, -8m, -9m, -9m, -11m, -11m, -12m, -12m, -13m, -13m, -14m, -14m, -14m, -16m, -16m, -16m, -16m, -16m, -18m, -18m, -20m, -20m }
        );

        public static ПолеДопуска K7 = new ПолеДопуска(ОсновноеОтклонение.K, 7,
        new decimal[] { 3m, 6m, 10m, 14m, 18m, 24m, 30m, 40m, 50m, 65m, 80m, 100m, 120m, 140m, 160m, 180m, 200m, 225m, 250m, 280m, 315m, 355m, 400m, 450m, 500m },
        new decimal[] { 0m, 3m, 5m, 6m, 6m, 6m, 6m, 7m, 7m, 9m, 9m, 10m, 10m, 12m, 12m, 12m, 13m, 13m, 13m, 16m, 16m, 17m, 17m, 18m, 18m },
        new decimal[] { -10m, -9m, -10m, -12m, -12m, -15m, -15m, -18m, -18m, -21m, -21m, -25m, -25m, -28m, -28m, -28m, -33m, -33m, -33m, -36m, -36m, -40m, -40m, -45m, -45m }
        );

        public static ПолеДопуска t6 = new ПолеДопуска(ОсновноеОтклонение.t, 6,
        new decimal[] { 3m, 6m, 10m, 14m, 18m, 24m, 30m, 40m, 50m, 65m, 80m, 100m, 120m, 140m, 160m, 180m, 200m, 225m, 250m, 280m, 315m, 355m, 400m, 450m, 500m, 560m },
        new decimal[] { 0m, 0m, 0m, 0m, 0m, 0m, 54m, 64m, 70m, 85m, 94m, 113m, 126m, 147m, 159m, 171m, 195m, 209m, 225m, 250m, 272m, 304m, 330m, 370m, 400m, 444m },
        new decimal[] { 0m, 0m, 0m, 0m, 0m, 0m, 41m, 48m, 54m, 66m, 75m, 91m, 104m, 122m, 134m, 146m, 166m, 180m, 196m, 218m, 240m, 268m, 294m, 330m, 360m, 400m }
        );

        public static ПолеДопуска M7 = new ПолеДопуска(ОсновноеОтклонение.M, 7,
        new decimal[] { 3m, 6m, 10m, 14m, 18m, 24m, 30m, 40m, 50m, 65m, 80m, 100m, 120m, 140m, 160m, 180m, 200m, 225m, 250m, 280m, 315m, 355m, 400m, 450m, 500m },
        new decimal[] { -2m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m },
        new decimal[] { -12m, -12m, -15m, -18m, -18m, -21m, -21m, -25m, -25m, -30m, -30m, -35m, -35m, -40m, -40m, -40m, -46m, -46m, -46m, -52m, -52m, -57m, -57m, -63m, -63m }
        );

        public static ПолеДопуска N7 = new ПолеДопуска(ОсновноеОтклонение.N, 7,
        new decimal[] { 3m, 6m, 10m, 14m, 18m, 24m, 30m, 40m, 50m, 65m, 80m, 100m, 120m, 140m, 160m, 180m, 200m, 225m, 250m, 280m, 315m, 355m, 400m, 450m, 500m },
        new decimal[] { -4m, -4m, -4m, -5m, -5m, -7m, -7m, -8m, -8m, -9m, -9m, -10m, -10m, -12m, -12m, -12m, -14m, -14m, -14m, -14m, -14m, -16m, -16m, -17m, -17m },
        new decimal[] { -14m, -16m, -19m, -23m, -23m, -28m, -28m, -33m, -33m, -39m, -39m, -45m, -45m, -52m, -52m, -52m, -60m, -60m, -60m, -66m, -66m, -73m, -73m, -80m, -80m }
        );

        public static ПолеДопуска H10 = new ПолеДопуска(ОсновноеОтклонение.H, 10,
        new decimal[] { 3m, 6m, 10m, 14m, 18m, 24m, 30m, 40m, 50m, 65m, 80m, 100m, 120m, 140m, 160m, 180m, 200m, 225m, 250m, 280m, 315m, 355m, 400m, 450m, 500m },
        new decimal[] { 40m, 48m, 58m, 70m, 70m, 84m, 84m, 100m, 100m, 120m, 120m, 140m, 140m, 160m, 160m, 160m, 185m, 185m, 185m, 210m, 210m, 230m, 230m, 250m, 250m },
        new decimal[] { 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m }
        );

        public static ПолеДопуска a11 = new ПолеДопуска(ОсновноеОтклонение.a, 11,
        new decimal[] { 3m, 6m, 10m, 14m, 18m, 24m, 30m, 40m, 50m, 65m, 80m, 100m, 120m, 140m, 160m, 180m, 200m, 225m, 250m, 280m, 315m, 355m, 400m, 450m, 500m, 560m },
        new decimal[] { -270m, -270m, -280m, -290m, -290m, -300m, -300m, -310m, -320m, -340m, -360m, -380m, -410m, -460m, -520m, -580m, -660m, -740m, -820m, -920m, -1050m, -1200m, -1350m, -1500m, -1650m, -1650m },
        new decimal[] { -330m, -345m, -370m, -400m, -400m, -430m, -430m, -470m, -480m, -530m, -550m, -600m, -630m, -710m, -770m, -830m, -950m, -1030m, -1110m, -1240m, -1370m, -1560m, -1710m, -1900m, -2050m, -2050m }
        );

        public static ПолеДопуска b11 = new ПолеДопуска(ОсновноеОтклонение.b, 11,
        new decimal[] { 3m, 6m, 10m, 14m, 18m, 24m, 30m, 40m, 50m, 65m, 80m, 100m, 120m, 140m, 160m, 180m, 200m, 225m, 250m, 280m, 315m, 355m, 400m, 450m, 500m, 560m },
        new decimal[] { -140m, -140m, -150m, -150m, -150m, -160m, -160m, -170m, -180m, -190m, -200m, -220m, -240m, -260m, -280m, -310m, -340m, -380m, -420m, -480m, -540m, -600m, -680m, -760m, -840m, -840m },
        new decimal[] { -200m, -215m, -240m, -260m, -260m, -290m, -290m, -330m, -340m, -380m, -390m, -440m, -460m, -510m, -530m, -560m, -630m, -670m, -710m, -800m, -860m, -960m, -1040m, -1160m, -1240m, -1240m }
        );

        public static ПолеДопуска c11 = new ПолеДопуска(ОсновноеОтклонение.c, 11,
        new decimal[] { 3m, 6m, 10m, 14m, 18m, 24m, 30m, 40m, 50m, 65m, 80m, 100m, 120m, 140m, 160m, 180m, 200m, 225m, 250m, 280m, 315m, 355m, 400m, 450m, 500m, 560m },
        new decimal[] { -60m, -70m, -80m, -95m, -95m, -110m, -110m, -120m, -130m, -140m, -150m, -170m, -180m, -200m, -210m, -230m, -240m, -260m, -280m, -300m, -330m, -360m, -400m, -440m, -480m, -520m },
        new decimal[] { -120m, -145m, -170m, -205m, -205m, -240m, -240m, -280m, -290m, -330m, -340m, -390m, -400m, -450m, -460m, -480m, -530m, -550m, -570m, -620m, -650m, -720m, -760m, -840m, -880m, -960m }
        );

        public static ПолеДопуска d11 = new ПолеДопуска(ОсновноеОтклонение.d, 11,
        new decimal[] { 3m, 6m, 10m, 14m, 18m, 24m, 30m, 40m, 50m, 65m, 80m, 100m, 120m, 140m, 160m, 180m, 200m, 225m, 250m, 280m, 315m, 355m, 400m, 450m, 500m, 560m },
        new decimal[] { -20m, -30m, -40m, -50m, -50m, -65m, -65m, -80m, -80m, -100m, -100m, -120m, -120m, -145m, -145m, -145m, -170m, -170m, -170m, -190m, -190m, -210m, -210m, -230m, -230m, -260m },
        new decimal[] { -80m, -105m, -130m, -160m, -160m, -195m, -195m, -240m, -240m, -290m, -290m, -340m, -340m, -395m, -395m, -395m, -460m, -460m, -460m, -510m, -510m, -570m, -570m, -630m, -630m, -700m }
        );

        public static ПолеДопуска F7 = new ПолеДопуска(ОсновноеОтклонение.F, 7,
        new decimal[] { 3m, 6m, 10m, 14m, 18m, 24m, 30m, 40m, 50m, 65m, 80m, 100m, 120m, 140m, 160m, 180m, 200m, 225m, 250m, 280m, 315m, 355m, 400m, 450m, 500m },
        new decimal[] { 16m, 22m, 28m, 34m, 34m, 41m, 41m, 50m, 50m, 60m, 60m, 71m, 71m, 83m, 83m, 83m, 96m, 96m, 96m, 108m, 108m, 119m, 119m, 131m, 131m },
        new decimal[] { 6m, 10m, 13m, 16m, 16m, 20m, 20m, 25m, 25m, 30m, 30m, 36m, 36m, 43m, 43m, 43m, 50m, 50m, 50m, 56m, 56m, 62m, 62m, 68m, 68m }
        );

        public static ПолеДопуска G7 = new ПолеДопуска(ОсновноеОтклонение.G, 7,
        new decimal[] { 3m, 6m, 10m, 14m, 18m, 24m, 30m, 40m, 50m, 65m, 80m, 100m, 120m, 140m, 160m, 180m, 200m, 225m, 250m, 280m, 315m, 355m, 400m, 450m, 500m },
        new decimal[] { 12m, 16m, 20m, 24m, 24m, 28m, 28m, 34m, 34m, 40m, 40m, 47m, 47m, 54m, 54m, 54m, 61m, 61m, 61m, 69m, 69m, 75m, 75m, 83m, 83m },
        new decimal[] { 2m, 4m, 5m, 6m, 6m, 7m, 7m, 9m, 9m, 10m, 10m, 12m, 12m, 14m, 14m, 14m, 15m, 15m, 15m, 17m, 17m, 18m, 18m, 20m, 20m }
        );

        public static ПолеДопуска x7 = new ПолеДопуска(ОсновноеОтклонение.x, 7,
        new decimal[] { 3m, 6m, 10m, 14m, 18m, 24m, 30m, 40m, 50m, 65m, 80m, 100m, 120m, 140m, 160m, 180m, 200m, 225m, 250m, 280m, 315m, 355m, 400m, 450m, 500m, 560m },
        new decimal[] { 30m, 40m, 49m, 58m, 63m, 75m, 85m, 105m, 122m, 152m, 176m, 213m, 245m, 288m, 320m, 350m, 396m, 431m, 471m, 527m, 577m, 647m, 717m, 803m, 883m, 883m },
        new decimal[] { 20m, 28m, 34m, 40m, 45m, 54m, 64m, 80m, 97m, 122m, 146m, 178m, 210m, 248m, 280m, 310m, 350m, 385m, 425m, 475m, 525m, 590m, 660m, 740m, 820m, 820m }
        );

        public static ПолеДопуска n4 = new ПолеДопуска(ОсновноеОтклонение.n, 4,
        new decimal[] { 3m, 6m, 10m, 14m, 18m, 24m, 30m, 40m, 50m, 65m, 80m, 100m, 120m, 140m, 160m, 180m, 200m, 225m, 250m, 280m, 315m, 355m, 400m, 450m, 500m, 560m },
        new decimal[] { 7m, 12m, 14m, 17m, 17m, 21m, 21m, 24m, 24m, 28m, 28m, 33m, 33m, 39m, 39m, 39m, 45m, 45m, 45m, 50m, 50m, 55m, 55m, 60m, 60m, 66m },
        new decimal[] { 4m, 8m, 10m, 12m, 12m, 15m, 15m, 17m, 17m, 20m, 20m, 23m, 23m, 27m, 27m, 27m, 31m, 31m, 31m, 34m, 34m, 37m, 37m, 40m, 40m, 44m }
        );

        public static ПолеДопуска d6 = new ПолеДопуска(ОсновноеОтклонение.d, 6,
        new decimal[] { 3m, 6m, 10m, 14m, 18m, 24m, 30m, 40m, 50m, 65m, 80m, 100m, 120m, 140m, 160m, 180m, 200m, 225m, 250m, 280m, 315m, 355m, 400m, 450m, 500m, 560m },
        new decimal[] { -20m, -30m, -40m, -50m, -50m, -65m, -65m, -80m, -80m, -100m, -100m, -120m, -120m, -145m, -145m, -145m, -170m, -170m, -170m, -190m, -190m, -210m, -210m, -230m, -230m, -230m },
        new decimal[] { -26m, -38m, -49m, -61m, -61m, -78m, -78m, -96m, -96m, -119m, -119m, -142m, -142m, -170m, -170m, -170m, -199m, -199m, -199m, -222m, -222m, -246m, -246m, -270m, -270m, -270m }
        );

        public static ПолеДопуска e6 = new ПолеДопуска(ОсновноеОтклонение.e, 6,
        new decimal[] { 3m, 6m, 10m, 14m, 18m, 24m, 30m, 40m, 50m, 65m, 80m, 100m, 120m, 140m, 160m, 180m, 200m, 225m, 250m, 280m, 315m, 355m, 400m, 450m, 500m, 560m },
        new decimal[] { -14m, -20m, -25m, -32m, -32m, -40m, -40m, -50m, -50m, -60m, -60m, -72m, -72m, -85m, -85m, -85m, -100m, -100m, -100m, -110m, -110m, -125m, -125m, -135m, -135m, -145m },
        new decimal[] { -20m, -28m, -34m, -43m, -43m, -53m, -53m, -66m, -66m, -79m, -79m, -94m, -94m, -110m, -110m, -110m, -129m, -129m, -129m, -142m, -142m, -161m, -161m, -175m, -175m, -189m }
        );

        public static ПолеДопуска f6 = new ПолеДопуска(ОсновноеОтклонение.f, 6,
        new decimal[] { 3m, 6m, 10m, 14m, 18m, 24m, 30m, 40m, 50m, 65m, 80m, 100m, 120m, 140m, 160m, 180m, 200m, 225m, 250m, 280m, 315m, 355m, 400m, 450m, 500m, 560m },
        new decimal[] { -6m, -10m, -13m, -16m, -16m, -20m, -20m, -25m, -25m, -30m, -30m, -36m, -36m, -43m, -43m, -43m, -50m, -50m, -50m, -56m, -56m, -62m, -62m, -68m, -68m, -76m },
        new decimal[] { -12m, -18m, -22m, -27m, -27m, -33m, -33m, -41m, -41m, -49m, -49m, -58m, -58m, -68m, -68m, -68m, -79m, -79m, -79m, -88m, -88m, -98m, -98m, -108m, -108m, -120m }
        );

        public static ПолеДопуска g6 = new ПолеДопуска(ОсновноеОтклонение.g, 6,
        new decimal[] { 3m, 6m, 10m, 14m, 18m, 24m, 30m, 40m, 50m, 65m, 80m, 100m, 120m, 140m, 160m, 180m, 200m, 225m, 250m, 280m, 315m, 355m, 400m, 450m, 500m, 560m },
        new decimal[] { -2m, -4m, -5m, -6m, -6m, -7m, -7m, -9m, -9m, -10m, -10m, -12m, -12m, -14m, -14m, -14m, -15m, -15m, -15m, -17m, -17m, -18m, -18m, -20m, -20m, -22m },
        new decimal[] { -8m, -12m, -14m, -17m, -17m, -20m, -20m, -25m, -25m, -29m, -29m, -34m, -34m, -39m, -39m, -39m, -44m, -44m, -44m, -49m, -49m, -54m, -54m, -60m, -60m, -66m }
        );

        public static ПолеДопуска p7 = new ПолеДопуска(ОсновноеОтклонение.p, 7,
        new decimal[] { 3m, 6m, 10m, 14m, 18m, 24m, 30m, 40m, 50m, 65m, 80m, 100m, 120m, 140m, 160m, 180m, 200m, 225m, 250m, 280m, 315m, 355m, 400m, 450m, 500m, 560m },
        new decimal[] { 16m, 24m, 30m, 36m, 36m, 43m, 43m, 51m, 51m, 62m, 62m, 72m, 72m, 83m, 83m, 83m, 96m, 96m, 96m, 108m, 108m, 119m, 119m, 131m, 131m, 148m },
        new decimal[] { 6m, 12m, 15m, 18m, 18m, 22m, 22m, 26m, 26m, 32m, 32m, 37m, 37m, 43m, 43m, 43m, 50m, 50m, 50m, 56m, 56m, 62m, 62m, 68m, 68m, 78m }
        );

        public static ПолеДопуска r7 = new ПолеДопуска(ОсновноеОтклонение.r, 7,
        new decimal[] { 3m, 6m, 10m, 14m, 18m, 24m, 30m, 40m, 50m, 65m, 80m, 100m, 120m, 140m, 160m, 180m, 200m, 225m, 250m, 280m, 315m, 355m, 400m, 450m, 500m, 560m },
        new decimal[] { 20m, 27m, 34m, 41m, 41m, 49m, 49m, 59m, 59m, 71m, 73m, 86m, 89m, 103m, 105m, 108m, 123m, 126m, 130m, 146m, 150m, 165m, 171m, 189m, 195m, 220m },
        new decimal[] { 10m, 15m, 19m, 23m, 23m, 28m, 28m, 34m, 34m, 41m, 43m, 51m, 54m, 63m, 65m, 68m, 77m, 80m, 84m, 94m, 98m, 108m, 114m, 126m, 132m, 150m }
        );

        public static ПолеДопуска s7 = new ПолеДопуска(ОсновноеОтклонение.s, 7,
        new decimal[] { 3m, 6m, 10m, 14m, 18m, 24m, 30m, 40m, 50m, 65m, 80m, 100m, 120m, 140m, 160m, 180m, 200m, 225m, 250m, 280m, 315m, 355m, 400m, 450m, 500m, 560m },
        new decimal[] { 24m, 31m, 38m, 46m, 46m, 56m, 56m, 68m, 68m, 83m, 89m, 106m, 114m, 132m, 140m, 148m, 168m, 176m, 186m, 210m, 222m, 247m, 265m, 295m, 315m, 350m },
        new decimal[] { 14m, 19m, 23m, 28m, 28m, 35m, 35m, 43m, 43m, 53m, 59m, 71m, 79m, 92m, 100m, 108m, 122m, 130m, 140m, 158m, 170m, 190m, 208m, 232m, 252m, 280m }
        );

        public static ПолеДопуска p5 = new ПолеДопуска(ОсновноеОтклонение.p, 5,
        new decimal[] { 3m, 6m, 10m, 14m, 18m, 24m, 30m, 40m, 50m, 65m, 80m, 100m, 120m, 140m, 160m, 180m, 200m, 225m, 250m, 280m, 315m, 355m, 400m, 450m, 500m, 560m },
        new decimal[] { 10m, 17m, 21m, 26m, 26m, 31m, 31m, 37m, 37m, 45m, 45m, 52m, 52m, 61m, 61m, 61m, 70m, 70m, 70m, 79m, 79m, 87m, 87m, 95m, 95m, 108m },
        new decimal[] { 6m, 12m, 15m, 18m, 18m, 22m, 22m, 26m, 26m, 32m, 32m, 37m, 37m, 43m, 43m, 43m, 50m, 50m, 50m, 56m, 56m, 62m, 62m, 68m, 68m, 78m }
        );

        public static ПолеДопуска u7 = new ПолеДопуска(ОсновноеОтклонение.u, 7,
        new decimal[] { 3m, 6m, 10m, 14m, 18m, 24m, 30m, 40m, 50m, 65m, 80m, 100m, 120m, 140m, 160m, 180m, 200m, 225m, 250m, 280m, 315m, 355m, 400m, 450m, 500m, 560m },
        new decimal[] { 28m, 35m, 43m, 51m, 51m, 62m, 69m, 85m, 95m, 117m, 132m, 159m, 179m, 210m, 230m, 250m, 282m, 304m, 330m, 367m, 402m, 447m, 492m, 553m, 603m, 670m },
        new decimal[] { 18m, 23m, 28m, 33m, 33m, 41m, 48m, 60m, 70m, 87m, 102m, 124m, 144m, 170m, 190m, 210m, 236m, 258m, 284m, 315m, 350m, 390m, 435m, 490m, 540m, 600m }
        );

        public static ПолеДопуска v7 = new ПолеДопуска(ОсновноеОтклонение.v, 7,
        new decimal[] { 3m, 6m, 10m, 14m, 18m, 24m, 30m, 40m, 50m, 65m, 80m, 100m, 120m, 140m, 160m, 180m, 200m, 225m, 250m, 280m, 315m, 355m, 400m, 450m, 500m, 560m },
        new decimal[] { 0m, 0m, 0m, 0m, 57m, 68m, 76m, 93m, 106m, 132m, 150m, 181m, 207m, 242m, 268m, 292m, 330m, 356m, 386m, 437m, 477m, 532m, 587m, 658m, 723m, 810m },
        new decimal[] { 0m, 0m, 0m, 0m, 39m, 47m, 55m, 68m, 81m, 102m, 120m, 146m, 172m, 202m, 228m, 252m, 284m, 310m, 340m, 385m, 425m, 475m, 530m, 595m, 660m, 740m }
        );

        public static ПолеДопуска h7 = new ПолеДопуска(ОсновноеОтклонение.h, 7,
        new decimal[] { 3m, 6m, 10m, 14m, 18m, 24m, 30m, 40m, 50m, 65m, 80m, 100m, 120m, 140m, 160m, 180m, 200m, 225m, 250m, 280m, 315m, 355m, 400m, 450m, 500m, 560m },
        new decimal[] { 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m },
        new decimal[] { -10m, -12m, -15m, -18m, -18m, -21m, -21m, -25m, -25m, -30m, -30m, -35m, -35m, -40m, -40m, -40m, -46m, -46m, -46m, -52m, -52m, -57m, -57m, -63m, -63m, -70m }
        );

        public static ПолеДопуска cd9 = new ПолеДопуска(ОсновноеОтклонение.cd, 9,
        new decimal[] { 3m, 6m, 10m },
        new decimal[] { -34m, -46m, -56m },
        new decimal[] { -59m, -76m, -92m }
        );

        public static ПолеДопуска H16 = new ПолеДопуска(ОсновноеОтклонение.H, 16,
        new decimal[] { 3m, 6m, 10m, 14m, 18m, 24m, 30m, 40m, 50m, 65m, 80m, 100m, 120m, 140m, 160m, 180m, 200m, 225m, 250m, 280m, 315m, 355m, 400m, 450m, 500m },
        new decimal[] { 600m, 750m, 900m, 1100m, 1100m, 1300m, 1300m, 1600m, 1600m, 1900m, 1900m, 2200m, 2200m, 2500m, 2500m, 2500m, 2900m, 2900m, 2900m, 3200m, 3200m, 3600m, 3600m, 4000m, 4000m },
        new decimal[] { 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m }
        );

        public static ПолеДопуска js13 = new ПолеДопуска(ОсновноеОтклонение.js, 13,
        new decimal[] { 3m, 6m, 10m, 14m, 18m, 24m, 30m, 40m, 50m, 65m, 80m, 100m, 120m, 140m, 160m, 180m, 200m, 225m, 250m, 280m, 315m, 355m, 400m, 450m, 500m, 560m },
        new decimal[] { 70m, 90m, 110m, 135m, 135m, 165m, 165m, 195m, 195m, 230m, 230m, 270m, 270m, 315m, 315m, 315m, 360m, 360m, 360m, 405m, 405m, 445m, 445m, 485m, 485m, 550m },
        new decimal[] { -70m, -90m, -110m, -135m, -135m, -165m, -165m, -195m, -195m, -230m, -230m, -270m, -270m, -315m, -315m, -315m, -360m, -360m, -360m, -405m, -405m, -445m, -445m, -485m, -485m, -550m }
        );

        public static ПолеДопуска m5 = new ПолеДопуска(ОсновноеОтклонение.m, 5,
        new decimal[] { 3m, 6m, 10m, 14m, 18m, 24m, 30m, 40m, 50m, 65m, 80m, 100m, 120m, 140m, 160m, 180m, 200m, 225m, 250m, 280m, 315m, 355m, 400m, 450m, 500m, 560m },
        new decimal[] { 6m, 9m, 12m, 15m, 15m, 17m, 17m, 20m, 20m, 24m, 24m, 28m, 28m, 33m, 33m, 33m, 37m, 37m, 37m, 43m, 43m, 46m, 46m, 50m, 50m, 56m },
        new decimal[] { 2m, 4m, 6m, 7m, 7m, 8m, 8m, 9m, 9m, 11m, 11m, 13m, 13m, 15m, 15m, 15m, 17m, 17m, 17m, 20m, 20m, 21m, 21m, 23m, 23m, 26m }
        );

        public static ПолеДопуска za8 = new ПолеДопуска(ОсновноеОтклонение.za, 8,
        new decimal[] { 3m, 6m, 10m, 14m, 18m },
        new decimal[] { 46m, 60m, 74m, 91m, 104m },
        new decimal[] { 32m, 42m, 52m, 64m, 77m }
        );

        public static ПолеДопуска zc8 = new ПолеДопуска(ОсновноеОтклонение.zc, 8,
        new decimal[] { 3m, 6m, 10m, 14m, 18m },
        new decimal[] { 74m, 98m, 119m, 157m, 177m },
        new decimal[] { 60m, 80m, 97m, 130m, 150m }
        );

        public static ПолеДопуска d7 = new ПолеДопуска(ОсновноеОтклонение.d, 7,
        new decimal[] { 3m, 6m, 10m, 14m, 18m, 24m, 30m, 40m, 50m, 65m, 80m, 100m, 120m, 140m, 160m, 180m, 200m, 225m, 250m, 280m, 315m, 355m, 400m, 450m, 500m, 560m },
        new decimal[] { -20m, -30m, -40m, -50m, -50m, -65m, -65m, -80m, -80m, -100m, -100m, -120m, -120m, -145m, -145m, -145m, -170m, -170m, -170m, -190m, -190m, -210m, -210m, -230m, -230m, -230m },
        new decimal[] { -30m, -42m, -55m, -68m, -68m, -86m, -86m, -105m, -105m, -130m, -130m, -155m, -155m, -185m, -185m, -185m, -216m, -216m, -216m, -242m, -242m, -267m, -267m, -293m, -293m, -293m }
        );

        public static ПолеДопуска e7 = new ПолеДопуска(ОсновноеОтклонение.e, 7,
        new decimal[] { 3m, 6m, 10m, 14m, 18m, 24m, 30m, 40m, 50m, 65m, 80m, 100m, 120m, 140m, 160m, 180m, 200m, 225m, 250m, 280m, 315m, 355m, 400m, 450m, 500m, 560m },
        new decimal[] { -14m, -20m, -25m, -32m, -32m, -40m, -40m, -50m, -50m, -60m, -60m, -72m, -72m, -85m, -85m, -85m, -100m, -100m, -100m, -110m, -110m, -125m, -125m, -135m, -135m, -145m },
        new decimal[] { -24m, -32m, -40m, -50m, -50m, -61m, -61m, -75m, -75m, -90m, -90m, -107m, -107m, -125m, -125m, -125m, -146m, -146m, -146m, -162m, -162m, -182m, -182m, -198m, -198m, -215m }
        );

        public static ПолеДопуска f7 = new ПолеДопуска(ОсновноеОтклонение.f, 7,
        new decimal[] { 3m, 6m, 10m, 14m, 18m, 24m, 30m, 40m, 50m, 65m, 80m, 100m, 120m, 140m, 160m, 180m, 200m, 225m, 250m, 280m, 315m, 355m, 400m, 450m, 500m, 560m },
        new decimal[] { -6m, -10m, -13m, -16m, -16m, -20m, -20m, -25m, -25m, -30m, -30m, -36m, -36m, -43m, -43m, -43m, -50m, -50m, -50m, -56m, -56m, -62m, -62m, -68m, -68m, -76m },
        new decimal[] { -16m, -22m, -28m, -34m, -34m, -41m, -41m, -50m, -50m, -60m, -60m, -71m, -71m, -83m, -83m, -83m, -96m, -96m, -96m, -108m, -108m, -119m, -119m, -131m, -131m, -146m }
        );

        public static ПолеДопуска g7 = new ПолеДопуска(ОсновноеОтклонение.g, 7,
        new decimal[] { 3m, 6m, 10m, 14m, 18m, 24m, 30m, 40m, 50m, 65m, 80m, 100m, 120m, 140m, 160m, 180m, 200m, 225m, 250m, 280m, 315m, 355m, 400m, 450m, 500m, 560m },
        new decimal[] { -2m, -4m, -5m, -6m, -6m, -7m, -7m, -9m, -9m, -10m, -10m, -12m, -12m, -14m, -14m, -14m, -15m, -15m, -15m, -17m, -17m, -18m, -18m, -20m, -20m, -22m },
        new decimal[] { -12m, -16m, -20m, -24m, -24m, -28m, -28m, -34m, -34m, -40m, -40m, -47m, -47m, -54m, -54m, -54m, -61m, -61m, -61m, -69m, -69m, -75m, -75m, -83m, -83m, -92m }
        );

        public static ПолеДопуска js9 = new ПолеДопуска(ОсновноеОтклонение.js, 9,
        new decimal[] { 3m, 6m, 10m, 14m, 18m, 24m, 30m, 40m, 50m, 65m, 80m, 100m, 120m, 140m, 160m, 180m, 200m, 225m, 250m, 280m, 315m, 355m, 400m, 450m, 500m, 560m },
        new decimal[] { 12m, 15m, 18m, 21m, 21m, 26m, 26m, 31m, 31m, 37m, 37m, 43m, 43m, 50m, 50m, 50m, 57m, 57m, 57m, 65m, 65m, 70m, 70m, 77m, 77m, 87m },
        new decimal[] { -12m, -15m, -18m, -21m, -21m, -26m, -26m, -31m, -31m, -37m, -37m, -43m, -43m, -50m, -50m, -50m, -57m, -57m, -57m, -65m, -65m, -70m, -70m, -77m, -77m, -87m }
        );

        public static ПолеДопуска n7 = new ПолеДопуска(ОсновноеОтклонение.n, 7,
        new decimal[] { 3m, 6m, 10m, 14m, 18m, 24m, 30m, 40m, 50m, 65m, 80m, 100m, 120m, 140m, 160m, 180m, 200m, 225m, 250m, 280m, 315m, 355m, 400m, 450m, 500m, 560m },
        new decimal[] { 14m, 20m, 25m, 30m, 30m, 36m, 36m, 42m, 42m, 50m, 50m, 58m, 58m, 67m, 67m, 67m, 77m, 77m, 77m, 86m, 86m, 94m, 94m, 103m, 103m, 114m },
        new decimal[] { 4m, 8m, 10m, 12m, 12m, 15m, 15m, 17m, 17m, 20m, 20m, 23m, 23m, 27m, 27m, 27m, 31m, 31m, 31m, 34m, 34m, 37m, 37m, 40m, 40m, 44m }
        );

        public static ПолеДопуска H13 = new ПолеДопуска(ОсновноеОтклонение.H, 13,
        new decimal[] { 3m, 6m, 10m, 14m, 18m, 24m, 30m, 40m, 50m, 65m, 80m, 100m, 120m, 140m, 160m, 180m, 200m, 225m, 250m, 280m, 315m, 355m, 400m, 450m, 500m },
        new decimal[] { 140m, 180m, 220m, 270m, 270m, 330m, 330m, 390m, 390m, 460m, 460m, 540m, 540m, 630m, 630m, 630m, 720m, 720m, 720m, 810m, 810m, 890m, 890m, 970m, 970m },
        new decimal[] { 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m }
        );

        public static ПолеДопуска Z8 = new ПолеДопуска(ОсновноеОтклонение.Z, 8,
        new decimal[] { 3m, 6m, 10m, 14m, 18m },
        new decimal[] { -26m, -35m, -42m, -50m, -60m },
        new decimal[] { -40m, -53m, -64m, -77m, -87m }
        );

        public static ПолеДопуска A13 = new ПолеДопуска(ОсновноеОтклонение.A, 13,
        new decimal[] { 3m, 6m, 10m, 14m, 18m, 24m, 30m, 40m, 50m, 65m, 80m, 100m, 120m, 140m, 160m, 180m, 200m, 225m, 250m, 280m, 315m, 355m, 400m, 450m, 500m },
        new decimal[] { 410m, 450m, 500m, 560m, 560m, 630m, 630m, 700m, 710m, 800m, 820m, 920m, 950m, 1090m, 1150m, 1210m, 1380m, 1460m, 1540m, 1730m, 1860m, 2090m, 2240m, 2470m, 2620m },
        new decimal[] { 270m, 270m, 280m, 290m, 290m, 300m, 300m, 310m, 320m, 340m, 360m, 380m, 410m, 460m, 520m, 580m, 660m, 740m, 820m, 920m, 1050m, 1200m, 1350m, 1500m, 1650m }
        );

        public static ПолеДопуска P8 = new ПолеДопуска(ОсновноеОтклонение.P, 8,
        new decimal[] { 3m, 6m, 10m, 14m, 18m, 24m, 30m, 40m, 50m, 65m, 80m, 100m, 120m, 140m, 160m, 180m, 200m, 225m, 250m, 280m, 315m, 355m, 400m, 450m, 500m },
        new decimal[] { -6m, -12m, -15m, -18m, -18m, -22m, -22m, -26m, -26m, -32m, -32m, -37m, -37m, -43m, -43m, -43m, -50m, -50m, -50m, -56m, -56m, -62m, -62m, -68m, -68m },
        new decimal[] { -20m, -30m, -37m, -45m, -45m, -55m, -55m, -65m, -65m, -78m, -78m, -91m, -91m, -106m, -106m, -106m, -122m, -122m, -122m, -137m, -137m, -151m, -151m, -165m, -165m }
        );

        public static ПолеДопуска C13 = new ПолеДопуска(ОсновноеОтклонение.C, 13,
        new decimal[] { 3m, 6m, 10m, 14m, 18m, 24m, 30m, 40m, 50m, 65m, 80m, 100m, 120m, 140m, 160m, 180m, 200m, 225m, 250m, 280m, 315m, 355m, 400m, 450m, 500m },
        new decimal[] { 200m, 250m, 300m, 365m, 365m, 440m, 440m, 510m, 520m, 600m, 610m, 710m, 720m, 830m, 840m, 860m, 960m, 980m, 1000m, 1110m, 1140m, 1250m, 1290m, 1410m, 1450m },
        new decimal[] { 60m, 70m, 80m, 95m, 95m, 110m, 110m, 120m, 130m, 140m, 150m, 170m, 180m, 200m, 210m, 230m, 240m, 260m, 280m, 300m, 330m, 360m, 400m, 440m, 480m }
        );

        public static ПолеДопуска R8 = new ПолеДопуска(ОсновноеОтклонение.R, 8,
        new decimal[] { 3m, 6m, 10m, 14m, 18m, 24m, 30m, 40m, 50m, 65m, 80m, 100m, 120m, 140m, 160m, 180m, 200m, 225m, 250m, 280m, 315m, 355m, 400m, 450m, 500m },
        new decimal[] { -10m, -15m, -19m, -23m, -23m, -28m, -28m, -34m, -34m, -41m, -43m, -51m, -54m, -63m, -65m, -68m, -77m, -80m, -84m, -94m, -98m, -108m, -114m, -126m, -132m },
        new decimal[] { -24m, -33m, -41m, -50m, -50m, -61m, -61m, -73m, -73m, -87m, -89m, -105m, -108m, -126m, -128m, -131m, -149m, -152m, -156m, -175m, -179m, -197m, -203m, -223m, -229m }
        );

        public static ПолеДопуска h16 = new ПолеДопуска(ОсновноеОтклонение.h, 16,
        new decimal[] { 3m, 6m, 10m, 14m, 18m, 24m, 30m, 40m, 50m, 65m, 80m, 100m, 120m, 140m, 160m, 180m, 200m, 225m, 250m, 280m, 315m, 355m, 400m, 450m, 500m, 560m },
        new decimal[] { 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m },
        new decimal[] { -600m, -750m, -900m, -1100m, -1100m, -1300m, -1300m, -1600m, -1600m, -1900m, -1900m, -2200m, -2200m, -2500m, -2500m, -2500m, -2900m, -2900m, -2900m, -3200m, -3200m, -3600m, -3600m, -4000m, -4000m, -4400m }
        );

        public static ПолеДопуска U8 = new ПолеДопуска(ОсновноеОтклонение.U, 8,
        new decimal[] { 3m, 6m, 10m, 14m, 18m, 24m, 30m, 40m, 50m, 65m, 80m, 100m, 120m, 140m, 160m, 180m, 200m, 225m, 250m, 280m, 315m, 355m, 400m, 450m, 500m },
        new decimal[] { -18m, -23m, -28m, -33m, -33m, -41m, -48m, -60m, -70m, -87m, -102m, -124m, -144m, -170m, -190m, -210m, -236m, -258m, -284m, -315m, -350m, -390m, -435m, -490m, -540m },
        new decimal[] { -32m, -41m, -50m, -60m, -60m, -74m, -81m, -99m, -109m, -133m, -148m, -178m, -198m, -233m, -253m, -273m, -308m, -330m, -356m, -396m, -431m, -479m, -524m, -587m, -637m }
        );

        public static ПолеДопуска H8 = new ПолеДопуска(ОсновноеОтклонение.H, 8,
        new decimal[] { 3m, 6m, 10m, 14m, 18m, 24m, 30m, 40m, 50m, 65m, 80m, 100m, 120m, 140m, 160m, 180m, 200m, 225m, 250m, 280m, 315m, 355m, 400m, 450m, 500m },
        new decimal[] { 14m, 18m, 22m, 27m, 27m, 33m, 33m, 39m, 39m, 46m, 46m, 54m, 54m, 63m, 63m, 63m, 72m, 72m, 72m, 81m, 81m, 89m, 89m, 97m, 97m },
        new decimal[] { 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m }
        );

        public static ПолеДопуска h17 = new ПолеДопуска(ОсновноеОтклонение.h, 17,
        new decimal[] { 3m, 6m, 10m, 14m, 18m, 24m, 30m, 40m, 50m, 65m, 80m, 100m, 120m, 140m, 160m, 180m, 200m, 225m, 250m, 280m, 315m, 355m, 400m, 450m, 500m },
        new decimal[] { 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m },
        new decimal[] { -1000m, -1200m, -1500m, -1800m, -1800m, -2100m, -2100m, -2500m, -2500m, -3000m, -3000m, -3500m, -3500m, -4000m, -4000m, -4000m, -4600m, -4600m, -4600m, -5200m, -5200m, -5700m, -5700m, -6300m, -6300m }
        );

        public static ПолеДопуска J8 = new ПолеДопуска(ОсновноеОтклонение.J, 8,
        new decimal[] { 3m, 6m, 10m, 14m, 18m, 24m, 30m, 40m, 50m, 65m, 80m, 100m, 120m, 140m, 160m, 180m, 200m, 225m, 250m, 280m, 315m, 355m, 400m, 450m, 500m },
        new decimal[] { 6m, 10m, 12m, 15m, 15m, 20m, 20m, 24m, 24m, 28m, 28m, 34m, 34m, 41m, 41m, 41m, 47m, 47m, 47m, 55m, 55m, 60m, 60m, 66m, 66m },
        new decimal[] { -8m, -8m, -10m, -12m, -12m, -13m, -13m, -15m, -15m, -18m, -18m, -20m, -20m, -22m, -22m, -22m, -25m, -25m, -25m, -26m, -26m, -29m, -29m, -31m, -31m }
        );

        public static ПолеДопуска K8 = new ПолеДопуска(ОсновноеОтклонение.K, 8,
        new decimal[] { 3m, 6m, 10m, 14m, 18m, 24m, 30m, 40m, 50m, 65m, 80m, 100m, 120m, 140m, 160m, 180m, 200m, 225m, 250m, 280m, 315m, 355m, 400m, 450m, 500m },
        new decimal[] { 0m, 5m, 6m, 8m, 8m, 10m, 10m, 12m, 12m, 14m, 14m, 16m, 16m, 20m, 20m, 20m, 22m, 22m, 22m, 25m, 25m, 28m, 28m, 29m, 29m },
        new decimal[] { -14m, -13m, -16m, -19m, -19m, -23m, -23m, -27m, -27m, -32m, -32m, -38m, -38m, -43m, -43m, -43m, -50m, -50m, -50m, -56m, -56m, 61m, -61m, -68m, -68m }
        );

        public static ПолеДопуска M8 = new ПолеДопуска(ОсновноеОтклонение.M, 8,
        new decimal[] { 3m, 6m, 10m, 14m, 18m, 24m, 30m, 40m, 50m, 65m, 80m, 100m, 120m, 140m, 160m, 180m, 200m, 225m, 250m, 280m, 315m, 355m, 400m, 450m, 500m },
        new decimal[] { 0m, 2m, 1m, 2m, 2m, 4m, 4m, 5m, 5m, 5m, 5m, 6m, 8m, 8m, 8m, 8m, 9m, 9m, 9m, 9m, 9m, 11m, 11m, 11m, 11m },
        new decimal[] { 0m, -16m, -21m, -25m, -25m, -29m, -29m, -34m, -34m, -41m, -41m, -48m, -55m, -55m, -55m, -55m, -63m, -63m, -63m, -72m, -72m, -78m, -78m, -86m, -86m }
        );

        public static ПолеДопуска N10 = new ПолеДопуска(ОсновноеОтклонение.N, 10,
        new decimal[] { 3m, 6m, 10m, 14m, 18m, 24m, 30m, 40m, 50m, 65m, 80m, 100m, 120m, 140m, 160m, 180m, 200m, 225m, 250m, 280m, 315m, 355m, 400m, 450m, 500m },
        new decimal[] { -4m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m },
        new decimal[] { -44m, -48m, -58m, -70m, -70m, -84m, -84m, -100m, -100m, -120m, -120m, -140m, -140m, -160m, -160m, -160m, -185m, -185m, -185m, -210m, -210m, -230m, -230m, -250m, -250m }
        );

        public static ПолеДопуска E7 = new ПолеДопуска(ОсновноеОтклонение.E, 7,
        new decimal[] { 3m, 6m, 10m, 14m, 18m, 24m, 30m, 40m, 50m, 65m, 80m, 100m, 120m, 140m, 160m, 180m, 200m, 225m, 250m, 280m, 315m, 355m, 400m, 450m, 500m },
        new decimal[] { 24m, 32m, 40m, 50m, 50m, 61m, 61m, 75m, 75m, 90m, 90m, 107m, 107m, 125m, 125m, 125m, 146m, 146m, 146m, 162m, 162m, 182m, 182m, 198m, 198m },
        new decimal[] { 14m, 20m, 25m, 32m, 32m, 40m, 40m, 50m, 50m, 60m, 60m, 72m, 72m, 85m, 85m, 85m, 100m, 100m, 100m, 110m, 110m, 125m, 125m, 135m, 135m }
        );

        public static ПолеДопуска C8 = new ПолеДопуска(ОсновноеОтклонение.C, 8,
        new decimal[] { 3m, 6m, 10m, 14m, 18m, 24m, 30m, 40m, 50m, 65m, 80m, 100m, 120m, 140m, 160m, 180m, 200m, 225m, 250m, 280m, 315m, 355m, 400m, 450m, 500m },
        new decimal[] { 74m, 88m, 102m, 122m, 122m, 143m, 143m, 159m, 169m, 186m, 196m, 224m, 234m, 263m, 273m, 293m, 312m, 332m, 352m, 381m, 411m, 449m, 489m, 537m, 577m },
        new decimal[] { 60m, 70m, 80m, 95m, 95m, 110m, 110m, 120m, 130m, 140m, 150m, 170m, 180m, 200m, 210m, 230m, 240m, 260m, 280m, 300m, 330m, 360m, 400m, 440m, 480m }
        );

        public static ПолеДопуска D10 = new ПолеДопуска(ОсновноеОтклонение.D, 10,
        new decimal[] { 3m, 6m, 10m, 14m, 18m, 24m, 30m, 40m, 50m, 65m, 80m, 100m, 120m, 140m, 160m, 180m, 200m, 225m, 250m, 280m, 315m, 355m, 400m, 450m, 500m },
        new decimal[] { 60m, 78m, 98m, 120m, 120m, 149m, 149m, 180m, 180m, 220m, 220m, 260m, 260m, 305m, 305m, 305m, 355m, 355m, 355m, 400m, 400m, 440m, 440m, 480m, 480m },
        new decimal[] { 20m, 30m, 40m, 50m, 50m, 65m, 65m, 80m, 80m, 100m, 100m, 120m, 120m, 145m, 145m, 145m, 170m, 170m, 170m, 190m, 190m, 210m, 210m, 230m, 230m }
        );

        public static ПолеДопуска E10 = new ПолеДопуска(ОсновноеОтклонение.E, 10,
        new decimal[] { 3m, 6m, 10m, 14m, 18m, 24m, 30m, 40m, 50m, 65m, 80m, 100m, 120m, 140m, 160m, 180m, 200m, 225m, 250m, 280m, 315m, 355m, 400m, 450m, 500m },
        new decimal[] { 54m, 68m, 83m, 102m, 102m, 124m, 124m, 150m, 150m, 180m, 180m, 212m, 212m, 245m, 245m, 245m, 285m, 285m, 285m, 320m, 320m, 355m, 355m, 385m, 385m },
        new decimal[] { 14m, 20m, 25m, 32m, 32m, 40m, 40m, 50m, 50m, 60m, 60m, 72m, 72m, 85m, 85m, 85m, 100m, 100m, 100m, 110m, 110m, 125m, 125m, 135m, 135m }
        );

        public static ПолеДопуска F10 = new ПолеДопуска(ОсновноеОтклонение.F, 10,
        new decimal[] { 3m, 6m, 10m, 14m, 18m, 24m, 30m, 40m, 50m },
        new decimal[] { 46m, 58m, 71m, 86m, 86m, 104m, 104m, 125m, 125m },
        new decimal[] { 6m, 10m, 13m, 16m, 16m, 20m, 20m, 25m, 25m }
        );

        public static ПолеДопуска P9 = new ПолеДопуска(ОсновноеОтклонение.P, 9,
        new decimal[] { 3m, 6m, 10m, 14m, 18m, 24m, 30m, 40m, 50m, 65m, 80m, 100m, 120m, 140m, 160m, 180m, 200m, 225m, 250m, 280m, 315m, 355m, 400m, 450m, 500m },
        new decimal[] { -6m, -12m, -15m, -18m, -18m, -22m, -22m, -26m, -26m, -32m, -32m, -37m, -37m, -43m, -43m, -43m, -50m, -50m, -50m, -56m, -56m, -62m, -62m, -68m, -68m },
        new decimal[] { -31m, -42m, -51m, -61m, -61m, -74m, -74m, -88m, -88m, -106m, -106m, -124m, -124m, -143m, -143m, -143m, -165m, -165m, -165m, -186m, -186m, -202m, -202m, -223m, -223m }
        );

        public static ПолеДопуска z8 = new ПолеДопуска(ОсновноеОтклонение.z, 8,
        new decimal[] { 3m, 6m, 10m, 14m, 18m, 24m, 30m, 40m, 50m, 65m, 80m, 100m, 120m, 140m, 160m, 180m, 200m, 225m, 250m, 280m, 315m, 355m, 400m, 450m, 500m, 560m },
        new decimal[] { 40m, 53m, 64m, 77m, 87m, 106m, 121m, 151m, 175m, 218m, 256m, 312m, 364m, 428m, 478m, 528m, 592m, 647m, 712m, 791m, 871m, 989m, 1089m, 1197m, 1347m, 1347m },
        new decimal[] { 26m, 35m, 42m, 50m, 60m, 73m, 88m, 112m, 136m, 172m, 210m, 258m, 310m, 365m, 415m, 465m, 520m, 575m, 640m, 710m, 790m, 900m, 1000m, 1100m, 1250m, 1250m }
        );

        public static ПолеДопуска s6 = new ПолеДопуска(ОсновноеОтклонение.s, 6,
        new decimal[] { 3m, 6m, 10m, 14m, 18m, 24m, 30m, 40m, 50m, 65m, 80m, 100m, 120m, 140m, 160m, 180m, 200m, 225m, 250m, 280m, 315m, 355m, 400m, 450m, 500m, 560m },
        new decimal[] { 20m, 27m, 32m, 39m, 39m, 48m, 48m, 59m, 59m, 72m, 78m, 93m, 101m, 117m, 125m, 133m, 151m, 159m, 169m, 190m, 202m, 226m, 244m, 272m, 292m, 324m },
        new decimal[] { 14m, 19m, 23m, 28m, 28m, 35m, 35m, 43m, 43m, 53m, 59m, 71m, 79m, 92m, 100m, 108m, 122m, 130m, 140m, 158m, 170m, 190m, 208m, 232m, 252m, 280m }
        );

        public static ПолеДопуска a13 = new ПолеДопуска(ОсновноеОтклонение.a, 13,
        new decimal[] { 3m, 6m, 10m, 14m, 18m, 24m, 30m, 40m, 50m, 65m, 80m, 100m, 120m, 140m, 160m, 180m, 200m, 225m, 250m, 280m, 315m, 355m, 400m, 450m, 500m, 560m },
        new decimal[] { -270m, -270m, -280m, -290m, -290m, -300m, -300m, -310m, -320m, -340m, -360m, -380m, -410m, -460m, -520m, -580m, -660m, -740m, -820m, -920m, -1050m, -1200m, -1350m, -1500m, -1650m, -1650m },
        new decimal[] { -410m, -450m, -500m, -560m, -560m, -630m, -630m, -700m, -710m, -800m, -820m, -920m, -950m, -1090m, -1150m, -1210m, -1380m, -1460m, -1540m, -1730m, -1860m, -2090m, -2240m, -2470m, -2620m, -2620m }
        );

        public static ПолеДопуска b13 = new ПолеДопуска(ОсновноеОтклонение.b, 13,
        new decimal[] { 3m, 6m, 10m, 14m, 18m, 24m, 30m, 40m, 50m, 65m, 80m, 100m, 120m, 140m, 160m, 180m, 200m, 225m, 250m, 280m, 315m, 355m, 400m, 450m, 500m, 560m },
        new decimal[] { -140m, -140m, -150m, -150m, -150m, -160m, -160m, -170m, -180m, -190m, -200m, -220m, -240m, -260m, -280m, -310m, -340m, -380m, -420m, -480m, -540m, -600m, -680m, -760m, -840m, -840m },
        new decimal[] { -280m, -320m, -370m, -420m, -420m, -490m, -490m, -560m, -570m, -650m, -660m, -760m, -780m, -890m, -910m, -940m, -1060m, -1100m, -1140m, -1290m, -1350m, -1490m, -1570m, -1730m, -1810m, -1810m }
        );

        public static ПолеДопуска CD9 = new ПолеДопуска(ОсновноеОтклонение.CD, 9,
        new decimal[] { 3m, 6m, 10m },
        new decimal[] { 59m, 76m, 92m },
        new decimal[] { 34m, 46m, 56m }
        );

        public static ПолеДопуска s8 = new ПолеДопуска(ОсновноеОтклонение.s, 8,
        new decimal[] { 3m, 6m, 10m, 14m, 18m, 24m, 30m, 40m, 50m, 65m, 80m, 100m, 120m, 140m, 160m, 180m, 200m, 225m, 250m, 280m, 315m, 355m, 400m, 450m, 500m, 560m },
        new decimal[] { 28m, 37m, 45m, 55m, 55m, 68m, 68m, 82m, 82m, 99m, 105m, 125m, 133m, 155m, 163m, 171m, 194m, 202m, 212m, 239m, 251m, 279m, 297m, 329m, 349m, 390m },
        new decimal[] { 14m, 19m, 23m, 28m, 28m, 35m, 35m, 43m, 43m, 53m, 59m, 71m, 79m, 92m, 100m, 108m, 122m, 130m, 140m, 158m, 170m, 190m, 208m, 232m, 252m, 280m }
        );

        public static ПолеДопуска JS13 = new ПолеДопуска(ОсновноеОтклонение.JS, 13,
        new decimal[] { 3m, 6m, 10m, 14m, 18m, 24m, 30m, 40m, 50m, 65m, 80m, 100m, 120m, 140m, 160m, 180m, 200m, 225m, 250m, 280m, 315m, 355m, 400m, 450m, 500m },
        new decimal[] { 70m, 90m, 110m, 135m, 135m, 165m, 165m, 195m, 195m, 230m, 230m, 270m, 270m, 315m, 315m, 315m, 360m, 360m, 360m, 405m, 405m, 445m, 445m, 485m, 485m },
        new decimal[] { -70m, -90m, -110m, -135m, -135m, -165m, -165m, -195m, -195m, -230m, -230m, -270m, -270m, -315m, -315m, -315m, -360m, -360m, -360m, -405m, -405m, -445m, -445m, -485m, -485m }
        );

        public static ПолеДопуска u8 = new ПолеДопуска(ОсновноеОтклонение.u, 8,
        new decimal[] { 3m, 6m, 10m, 14m, 18m, 24m, 30m, 40m, 50m, 65m, 80m, 100m, 120m, 140m, 160m, 180m, 200m, 225m, 250m, 280m, 315m, 355m, 400m, 450m, 500m, 560m },
        new decimal[] { 32m, 41m, 50m, 60m, 60m, 74m, 81m, 99m, 109m, 133m, 148m, 178m, 198m, 233m, 253m, 273m, 308m, 330m, 356m, 396m, 431m, 479m, 524m, 587m, 637m, 710m },
        new decimal[] { 18m, 23m, 28m, 33m, 33m, 41m, 48m, 60m, 70m, 87m, 102m, 124m, 144m, 170m, 190m, 210m, 236m, 258m, 284m, 315m, 350m, 390m, 435m, 490m, 540m, 600m }
        );

        public static ПолеДопуска N9 = new ПолеДопуска(ОсновноеОтклонение.N, 9,
        new decimal[] { 3m, 6m, 10m, 14m, 18m, 24m, 30m, 40m, 50m, 65m, 80m, 100m, 120m, 140m, 160m, 180m, 200m, 225m, 250m, 280m, 315m, 355m, 400m, 450m, 500m },
        new decimal[] { -4m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m },
        new decimal[] { -29m, -30m, -36m, -43m, -43m, -52m, -52m, -62m, -62m, -74m, -74m, -87m, -87m, -100m, -100m, -100m, -115m, -115m, -115m, -130m, -130m, -140m, -140m, -155m, -155m }
        );

        public static ПолеДопуска h8 = new ПолеДопуска(ОсновноеОтклонение.h, 8,
        new decimal[] { 3m, 6m, 10m, 14m, 18m, 24m, 30m, 40m, 50m, 65m, 80m, 100m, 120m, 140m, 160m, 180m, 200m, 225m, 250m, 280m, 315m, 355m, 400m, 450m, 500m, 560m },
        new decimal[] { 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m },
        new decimal[] { -14m, -18m, -22m, -27m, -27m, -33m, -33m, -39m, -39m, -46m, -46m, -54m, -54m, -63m, -63m, -63m, -72m, -72m, -72m, -81m, -81m, -89m, -89m, -97m, -97m, -110m }
        );

        public static ПолеДопуска A9 = new ПолеДопуска(ОсновноеОтклонение.A, 9,
        new decimal[] { 3m, 6m, 10m, 14m, 18m, 24m, 30m, 40m, 50m, 65m, 80m, 100m, 120m, 140m, 160m, 180m, 200m, 225m, 250m, 280m, 315m, 355m, 400m, 450m, 500m },
        new decimal[] { 295m, 300m, 316m, 333m, 333m, 352m, 352m, 372m, 382m, 414m, 434m, 467m, 497m, 560m, 620m, 680m, 775m, 855m, 935m, 1050m, 1180m, 1340m, 1490m, 1655m, 1805m },
        new decimal[] { 270m, 270m, 280m, 290m, 290m, 300m, 300m, 310m, 320m, 340m, 360m, 380m, 410m, 460m, 520m, 580m, 660m, 740m, 820m, 920m, 1050m, 1200m, 1350m, 1500m, 1650m }
        );

        public static ПолеДопуска B9 = new ПолеДопуска(ОсновноеОтклонение.B, 9,
        new decimal[] { 3m, 6m, 10m, 14m, 18m, 24m, 30m, 40m, 50m, 65m, 80m, 100m, 120m, 140m, 160m, 180m, 200m, 225m, 250m, 280m, 315m, 355m, 400m, 450m, 500m },
        new decimal[] { 165m, 170m, 186m, 193m, 193m, 212m, 212m, 232m, 242m, 264m, 274m, 307m, 327m, 360m, 380m, 410m, 455m, 495m, 535m, 610m, 670m, 740m, 820m, 915m, 995m },
        new decimal[] { 140m, 140m, 150m, 150m, 150m, 160m, 160m, 170m, 180m, 190m, 200m, 220m, 240m, 260m, 280m, 310m, 340m, 380m, 420m, 480m, 540m, 600m, 680m, 760m, 840m }
        );

        public static ПолеДопуска C9 = new ПолеДопуска(ОсновноеОтклонение.C, 9,
        new decimal[] { 3m, 6m, 10m, 14m, 18m, 24m, 30m, 40m, 50m, 65m, 80m, 100m, 120m, 140m, 160m, 180m, 200m, 225m, 250m, 280m, 315m, 355m, 400m, 450m, 500m },
        new decimal[] { 85m, 100m, 116m, 138m, 138m, 162m, 162m, 182m, 192m, 214m, 224m, 257m, 267m, 300m, 310m, 330m, 355m, 375m, 395m, 430m, 460m, 500m, 540m, 595m, 635m },
        new decimal[] { 60m, 70m, 80m, 95m, 95m, 110m, 110m, 120m, 130m, 140m, 150m, 170m, 180m, 200m, 210m, 230m, 240m, 260m, 280m, 300m, 330m, 360m, 400m, 440m, 480m }
        );

        public static ПолеДопуска D9 = new ПолеДопуска(ОсновноеОтклонение.D, 9,
        new decimal[] { 3m, 6m, 10m, 14m, 18m, 24m, 30m, 40m, 50m, 65m, 80m, 100m, 120m, 140m, 160m, 180m, 200m, 225m, 250m, 280m, 315m, 355m, 400m, 450m, 500m },
        new decimal[] { 45m, 60m, 76m, 93m, 93m, 117m, 117m, 142m, 142m, 174m, 174m, 207m, 207m, 245m, 245m, 245m, 285m, 285m, 285m, 320m, 320m, 350m, 350m, 385m, 385m },
        new decimal[] { 20m, 30m, 40m, 50m, 50m, 65m, 65m, 80m, 80m, 100m, 100m, 120m, 120m, 145m, 145m, 145m, 170m, 170m, 170m, 190m, 190m, 210m, 210m, 230m, 230m }
        );

        public static ПолеДопуска E9 = new ПолеДопуска(ОсновноеОтклонение.E, 9,
        new decimal[] { 3m, 6m, 10m, 14m, 18m, 24m, 30m, 40m, 50m, 65m, 80m, 100m, 120m, 140m, 160m, 180m, 200m, 225m, 250m, 280m, 315m, 355m, 400m, 450m, 500m },
        new decimal[] { 39m, 50m, 61m, 75m, 75m, 92m, 92m, 112m, 112m, 134m, 134m, 159m, 159m, 185m, 185m, 185m, 215m, 215m, 215m, 240m, 240m, 265m, 265m, 290m, 290m },
        new decimal[] { 14m, 20m, 25m, 32m, 32m, 40m, 40m, 50m, 50m, 60m, 60m, 72m, 72m, 85m, 85m, 85m, 100m, 100m, 100m, 110m, 110m, 125m, 125m, 135m, 135m }
        );

        public static ПолеДопуска F9 = new ПолеДопуска(ОсновноеОтклонение.F, 9,
        new decimal[] { 3m, 6m, 10m, 14m, 18m, 24m, 30m, 40m, 50m, 65m, 80m, 100m, 120m, 140m, 160m, 180m, 200m, 225m, 250m, 280m, 315m, 355m, 400m, 450m, 500m },
        new decimal[] { 31m, 40m, 49m, 59m, 59m, 72m, 72m, 87m, 87m, 104m, 104m, 123m, 123m, 143m, 143m, 143m, 165m, 165m, 165m, 186m, 186m, 202m, 202m, 223m, 223m },
        new decimal[] { 6m, 10m, 13m, 16m, 16m, 20m, 20m, 25m, 25m, 30m, 30m, 36m, 36m, 43m, 43m, 43m, 50m, 50m, 50m, 56m, 56m, 62m, 62m, 68m, 68m }
        );

        public static ПолеДопуска JS9 = new ПолеДопуска(ОсновноеОтклонение.JS, 9,
        new decimal[] { 3m, 6m, 10m, 14m, 18m, 24m, 30m, 40m, 50m, 65m, 80m, 100m, 120m, 140m, 160m, 180m, 200m, 225m, 250m, 280m, 315m, 355m, 400m, 450m, 500m },
        new decimal[] { 12m, 15m, 18m, 21m, 21m, 26m, 26m, 31m, 31m, 37m, 37m, 43m, 43m, 50m, 50m, 50m, 57m, 57m, 57m, 65m, 65m, 70m, 70m, 77m, 77m },
        new decimal[] { -12m, -15m, -18m, -21m, -21m, -26m, -26m, -31m, -31m, -37m, -37m, -43m, -43m, -50m, -50m, -50m, -57m, -57m, -57m, -65m, -65m, -70m, -70m, -77m, -77m }
        );

        public static ПолеДопуска E8 = new ПолеДопуска(ОсновноеОтклонение.E, 8,
        new decimal[] { 3m, 6m, 10m, 14m, 18m, 24m, 30m, 40m, 50m, 65m, 80m, 100m, 120m, 140m, 160m, 180m, 200m, 225m, 250m, 280m, 315m, 355m, 400m, 450m, 500m },
        new decimal[] { 28m, 38m, 47m, 59m, 59m, 73m, 73m, 89m, 89m, 106m, 106m, 126m, 126m, 148m, 148m, 148m, 172m, 172m, 172m, 191m, 191m, 214m, 214m, 232m, 232m },
        new decimal[] { 14m, 20m, 25m, 32m, 32m, 40m, 40m, 50m, 50m, 60m, 60m, 72m, 72m, 85m, 85m, 85m, 100m, 100m, 100m, 110m, 110m, 125m, 125m, 135m, 135m }
        );

        public static ПолеДопуска z9 = new ПолеДопуска(ОсновноеОтклонение.z, 9,
        new decimal[] { 3m, 6m, 10m, 14m, 18m, 24m, 30m, 40m, 50m, 65m, 80m, 100m, 120m, 140m, 160m, 180m, 200m, 225m, 250m, 280m, 315m, 355m, 400m, 450m, 500m, 560m },
        new decimal[] { 51m, 65m, 78m, 93m, 103m, 125m, 140m, 174m, 198m, 246m, 284m, 345m, 397m, 465m, 515m, 565m, 635m, 690m, 755m, 840m, 920m, 1040m, 1140m, 1255m, 1405m, 1405m },
        new decimal[] { 26m, 35m, 42m, 50m, 60m, 73m, 88m, 112m, 136m, 172m, 210m, 258m, 310m, 365m, 415m, 465m, 520m, 575m, 640m, 710m, 790m, 900m, 1000m, 1100m, 1250m, 1250m }
        );

        public static ПолеДопуска c8 = new ПолеДопуска(ОсновноеОтклонение.c, 8,
        new decimal[] { 3m, 6m, 10m, 14m, 18m, 24m, 30m, 40m, 50m, 65m, 80m, 100m, 120m, 140m, 160m, 180m, 200m, 225m, 250m, 280m, 315m, 355m, 400m, 450m, 500m, 560m },
        new decimal[] { -60m, -70m, -80m, -95m, -95m, -110m, -110m, -120m, -130m, -140m, -150m, -170m, -180m, -200m, -210m, -230m, -240m, -260m, -280m, -300m, -330m, -360m, -400m, -440m, -480m, -520m },
        new decimal[] { -74m, -88m, -102m, -122m, -122m, -143m, -143m, -159m, -169m, -186m, -196m, -224m, -234m, -263m, -273m, -293m, -312m, -332m, -352m, -381m, -411m, -449m, -489m, -537m, -577m, -630m }
        );

        public static ПолеДопуска d8 = new ПолеДопуска(ОсновноеОтклонение.d, 8,
        new decimal[] { 3m, 6m, 10m, 14m, 18m, 24m, 30m, 40m, 50m, 65m, 80m, 100m, 120m, 140m, 160m, 180m, 200m, 225m, 250m, 280m, 315m, 355m, 400m, 450m, 500m, 560m },
        new decimal[] { -20m, -30m, -40m, -50m, -50m, -65m, -65m, -80m, -80m, -100m, -100m, -120m, -120m, -145m, -145m, -145m, -170m, -170m, -170m, -190m, -190m, -210m, -210m, -230m, -230m, -260m },
        new decimal[] { -34m, -48m, -62m, -77m, -77m, -98m, -98m, -119m, -119m, -146m, -146m, -174m, -174m, -208m, -208m, -208m, -242m, -242m, -242m, -271m, -271m, -299m, -299m, -327m, -327m, -370m }
        );

        public static ПолеДопуска e8 = new ПолеДопуска(ОсновноеОтклонение.e, 8,
        new decimal[] { 3m, 6m, 10m, 14m, 18m, 24m, 30m, 40m, 50m, 65m, 80m, 100m, 120m, 140m, 160m, 180m, 200m, 225m, 250m, 280m, 315m, 355m, 400m, 450m, 500m, 560m },
        new decimal[] { -14m, -20m, -25m, -32m, -32m, -40m, -40m, -50m, -50m, -60m, -60m, -72m, -72m, -85m, -85m, -85m, -100m, -100m, -100m, -110m, -110m, -125m, -125m, -135m, -135m, -145m },
        new decimal[] { -28m, -38m, -47m, -59m, -59m, -73m, -73m, -89m, -89m, -106m, -106m, -126m, -126m, -148m, -148m, -148m, -172m, -172m, -172m, -191m, -191m, -214m, -214m, -232m, -232m, -255m }
        );

        public static ПолеДопуска f8 = new ПолеДопуска(ОсновноеОтклонение.f, 8,
        new decimal[] { 3m, 6m, 10m, 14m, 18m, 24m, 30m, 40m, 50m, 65m, 80m, 100m, 120m, 140m, 160m, 180m, 200m, 225m, 250m, 280m, 315m, 355m, 400m, 450m, 500m, 560m },
        new decimal[] { -6m, -10m, -13m, -16m, -16m, -20m, -20m, -25m, -25m, -30m, -30m, -36m, -36m, -43m, -43m, -43m, -50m, -50m, -50m, -56m, -56m, -62m, -62m, -68m, -68m, -76m },
        new decimal[] { -20m, -28m, -35m, -43m, -43m, -53m, -53m, -64m, -64m, -76m, -76m, -90m, -90m, -106m, -106m, -106m, -122m, -122m, -122m, -137m, -137m, -151m, -151m, -165m, -165m, -186m }
        );

        public static ПолеДопуска g8 = new ПолеДопуска(ОсновноеОтклонение.g, 8,
        new decimal[] { 3m, 6m, 10m, 14m, 18m, 24m, 30m, 40m, 50m, 65m, 80m, 100m, 120m, 140m, 160m, 180m, 200m, 225m, 250m, 280m, 315m, 355m, 400m, 450m, 500m, 560m },
        new decimal[] { -2m, -4m, -5m, -6m, -6m, -7m, -7m, -9m, -9m, -10m, -10m, -12m, -12m, -14m, -14m, -14m, -15m, -15m, -15m, -17m, -17m, -18m, -18m, -20m, -20m, -22m },
        new decimal[] { -16m, -22m, -27m, -33m, -33m, -40m, -40m, -48m, -48m, -56m, -56m, -66m, -66m, -77m, -77m, -77m, -87m, -87m, -87m, -98m, -98m, -107m, -107m, -117m, -117m, -132m }
        );

        public static ПолеДопуска js5 = new ПолеДопуска(ОсновноеОтклонение.js, 5,
        new decimal[] { 3m, 6m, 10m, 14m, 18m, 24m, 30m, 40m, 50m, 65m, 80m, 100m, 120m, 140m, 160m, 180m, 200m, 225m, 250m, 280m, 315m, 355m, 400m, 450m, 500m, 560m },
        new decimal[] { 2m, 2.5m, 3m, 4m, 4m, 4.5m, 4.5m, 5.5m, 5.5m, 6.5m, 6.5m, 7.5m, 7.5m, 9m, 9m, 9m, 10m, 10m, 10m, 11.5m, 11.5m, 12.5m, 12.5m, 13.5m, 13.5m, 15m },
        new decimal[] { -2m, -2.5m, -3m, -4m, -4m, -4.5m, -4.5m, -5.5m, -5.5m, -6.5m, -6.5m, -7.5m, -7.5m, -9m, -9m, -9m, -10m, -10m, -10m, -11.5m, -11.5m, -12.5m, -12.5m, -13.5m, -13.5m, -15m }
        );

        public static ПолеДопуска js15 = new ПолеДопуска(ОсновноеОтклонение.js, 15,
        new decimal[] { 3m, 6m, 10m, 14m, 18m, 24m, 24m, 40m, 50m, 65m, 80m, 100m, 120m, 140m, 160m, 180m, 200m, 225m, 250m, 280m, 315m, 355m, 400m, 450m, 500m },
        new decimal[] { 200m, 240m, 290m, 350m, 350m, 420m, 420m, 500m, 500m, 600m, 600m, 700m, 700m, 800m, 800m, 800m, 925m, 925m, 925m, 1050m, 1050m, 1150m, 1150m, 1250m, 1250m },
        new decimal[] { -200m, -240m, -290m, -350m, -350m, -420m, -420m, -500m, -500m, -600m, -600m, -700m, -700m, -800m, -800m, -800m, -925m, -925m, -925m, -1050m, -1050m, -1150m, -1150m, -1250m, -1250m }
        );

        public static ПолеДопуска JS17 = new ПолеДопуска(ОсновноеОтклонение.JS, 17,
        new decimal[] { 3m, 6m, 10m, 14m, 18m, 24m, 30m, 40m, 50m, 65m, 80m, 100m, 120m, 140m, 160m, 180m, 200m, 225m, 250m, 280m, 315m, 355m, 400m, 450m, 500m },
        new decimal[] { 500m, 600m, 750m, 900m, 900m, 1050m, 1050m, 1250m, 1250m, 1500m, 1500m, 1750m, 1750m, 2000m, 2000m, 2000m, 2300m, 2300m, 2300m, 2600m, 2600m, 2850m, 2850m, 3150m, 3150m },
        new decimal[] { -500m, -600m, -750m, -900m, -900m, -1050m, -1050m, -1250m, -1250m, -1500m, -1500m, -1750m, -1750m, -2000m, -2000m, -2000m, -2300m, -2300m, -2300m, -2600m, -2600m, -2850m, -2857m, -3150m, -3150m }
        );

        public static ПолеДопуска h9 = new ПолеДопуска(ОсновноеОтклонение.h, 9,
        new decimal[] { 3m, 6m, 10m, 14m, 18m, 24m, 30m, 40m, 50m, 65m, 80m, 100m, 120m, 140m, 160m, 180m, 200m, 225m, 250m, 280m, 315m, 355m, 400m, 450m, 500m, 560m },
        new decimal[] { 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m },
        new decimal[] { -25m, -30m, -36m, -43m, -43m, -52m, -52m, -62m, -62m, -74m, -74m, -87m, -87m, -100m, -100m, -100m, -115m, -115m, -115m, -130m, -130m, -140m, -140m, -155m, -155m, -175m }
        );

        public static ПолеДопуска h6 = new ПолеДопуска(ОсновноеОтклонение.h, 6,
        new decimal[] { 3m, 6m, 10m, 14m, 18m, 24m, 30m, 40m, 50m, 65m, 80m, 100m, 120m, 140m, 160m, 180m, 200m, 225m, 250m, 280m, 315m, 355m, 400m, 450m, 500m, 560m },
        new decimal[] { 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m },
        new decimal[] { -6m, -8m, -9m, -11m, -11m, -13m, -13m, -16m, -16m, -19m, -19m, -22m, -22m, -25m, -25m, -25m, -29m, -29m, -29m, -32m, -32m, -36m, -36m, -40m, -40m, -44m }
        );

        public static ПолеДопуска B13 = new ПолеДопуска(ОсновноеОтклонение.B, 13,
        new decimal[] { 3m, 6m, 10m, 14m, 18m, 24m, 30m, 40m, 50m, 65m, 80m, 100m, 120m, 140m, 160m, 180m, 200m, 225m, 250m, 280m, 315m, 355m, 400m, 450m, 500m },
        new decimal[] { 280m, 320m, 370m, 420m, 420m, 490m, 490m, 560m, 570m, 650m, 660m, 760m, 780m, 890m, 910m, 940m, 1060m, 1100m, 1140m, 1290m, 1350m, 1490m, 1570m, 1730m, 1810m },
        new decimal[] { 140m, 140m, 150m, 150m, 150m, 160m, 160m, 170m, 180m, 190m, 200m, 220m, 240m, 260m, 280m, 310m, 340m, 380m, 420m, 480m, 540m, 600m, 680m, 760m, 840m }
        );

        public static ПолеДопуска a9 = new ПолеДопуска(ОсновноеОтклонение.a, 9,
        new decimal[] { 3m, 6m, 10m, 14m, 18m, 24m, 30m, 40m, 50m, 65m, 80m, 100m, 120m, 140m, 160m, 180m, 200m, 225m, 250m, 280m, 315m, 355m, 400m, 450m, 500m, 560m },
        new decimal[] { -270m, -270m, -280m, -290m, -290m, -300m, -300m, -310m, -320m, -340m, -360m, -380m, -410m, -460m, -520m, -580m, -660m, -740m, -820m, -920m, -1050m, -1200m, -1350m, -1500m, -1650m, -1650m },
        new decimal[] { -295m, -300m, -316m, -333m, -333m, -352m, -352m, -372m, -382m, -414m, -434m, -467m, -497m, -560m, -620m, -680m, -775m, -855m, -935m, -1050m, -1180m, -1340m, -1490m, -1655m, -1805m, -1805m }
        );

        public static ПолеДопуска b9 = new ПолеДопуска(ОсновноеОтклонение.b, 9,
        new decimal[] { 3m, 6m, 10m, 14m, 18m, 24m, 30m, 40m, 50m, 65m, 80m, 100m, 120m, 140m, 160m, 180m, 200m, 225m, 250m, 280m, 315m, 355m, 400m, 450m, 500m, 560m },
        new decimal[] { -140m, -140m, -150m, -150m, -150m, -160m, -160m, -170m, -180m, -190m, -200m, -220m, -240m, -260m, -280m, -310m, -340m, -380m, -420m, -480m, -540m, -600m, -680m, -760m, -840m, -840m },
        new decimal[] { -165m, -170m, -186m, -193m, -193m, -212m, -212m, -232m, -242m, -264m, -274m, -307m, -327m, -360m, -380m, -410m, -455m, -495m, -535m, -610m, -670m, -740m, -820m, -915m, -995m, -955m }
        );

        public static ПолеДопуска c9 = new ПолеДопуска(ОсновноеОтклонение.c, 9,
        new decimal[] { 3m, 6m, 10m, 14m, 18m, 24m, 30m, 40m, 50m, 65m, 80m, 100m, 120m, 140m, 160m, 180m, 200m, 225m, 250m, 280m, 315m, 355m, 400m, 450m, 500m, 560m },
        new decimal[] { -60m, -70m, -80m, -95m, -95m, -110m, -110m, -120m, -130m, -140m, -150m, -170m, -180m, -200m, -210m, -230m, -240m, -260m, -280m, -300m, -330m, -360m, -400m, -440m, -480m, -520m },
        new decimal[] { -85m, -100m, -116m, -138m, -138m, -162m, -162m, -182m, -192m, -214m, -224m, -257m, -267m, -300m, -310m, -330m, -355m, -375m, -395m, -430m, -460m, -500m, -540m, -595m, -635m, -695m }
        );

        public static ПолеДопуска d9 = new ПолеДопуска(ОсновноеОтклонение.d, 9,
        new decimal[] { 3m, 6m, 10m, 14m, 18m, 24m, 30m, 40m, 50m, 65m, 80m, 100m, 120m, 140m, 160m, 180m, 200m, 225m, 250m, 280m, 315m, 355m, 400m, 450m, 500m, 560m },
        new decimal[] { -20m, -30m, -40m, -50m, -50m, -65m, -65m, -80m, -80m, -100m, -100m, -120m, -120m, -145m, -145m, -145m, -170m, -170m, -170m, -190m, -190m, -210m, -210m, -230m, -230m, -260m },
        new decimal[] { -45m, -60m, -76m, -93m, -93m, -117m, -117m, -142m, -142m, -174m, -174m, -207m, -207m, -245m, -245m, -245m, -285m, -285m, -285m, -320m, -320m, -350m, -350m, -385m, -385m, -435m }
        );

        public static ПолеДопуска e9 = new ПолеДопуска(ОсновноеОтклонение.e, 9,
        new decimal[] { 3m, 6m, 10m, 14m, 18m, 24m, 30m, 40m, 50m, 65m, 80m, 100m, 120m, 140m, 160m, 180m, 200m, 225m, 250m, 280m, 315m, 355m, 400m, 450m, 500m, 560m },
        new decimal[] { -14m, -20m, -25m, -32m, -32m, -40m, -40m, -50m, -50m, -60m, -60m, -72m, -72m, -85m, -85m, -85m, -100m, -100m, -100m, -110m, -110m, -125m, -125m, -135m, -135m, -145m },
        new decimal[] { -39m, -50m, -61m, -75m, -75m, -92m, -92m, -112m, -112m, -134m, -134m, -159m, -159m, -185m, -185m, -185m, -215m, -215m, -215m, -240m, -240m, -265m, -265m, -290m, -290m, -320m }
        );

        public static ПолеДопуска f9 = new ПолеДопуска(ОсновноеОтклонение.f, 9,
        new decimal[] { 3m, 6m, 10m, 14m, 18m, 24m, 30m, 40m, 50m, 65m, 80m, 100m, 120m, 140m, 160m, 180m, 200m, 225m, 250m, 280m, 315m, 355m, 400m, 450m, 500m, 560m },
        new decimal[] { -6m, -10m, -13m, -16m, -16m, -20m, -20m, -25m, -25m, -30m, -30m, -36m, -36m, -43m, -43m, -43m, -50m, -50m, -50m, -56m, -56m, -62m, -62m, -68m, -68m, -76m },
        new decimal[] { -31m, -40m, -49m, -59m, -59m, -72m, -72m, -87m, -87m, -104m, -104m, -123m, -123m, -143m, -143m, -143m, -165m, -165m, -165m, -186m, -186m, -202m, -202m, -223m, -223m, -251m }
        );

        public static ПолеДопуска js18 = new ПолеДопуска(ОсновноеОтклонение.js, 18,
        new decimal[] { 6m, 10m, 14m, 18m, 24m, 24m, 40m, 50m, 65m, 80m, 100m, 120m, 140m, 160m, 180m, 200m, 225m, 250m, 280m, 315m, 355m, 400m, 450m, 500m },
        new decimal[] { 900m, 1100m, 1350m, 1350m, 1650m, 1650m, 1950m, 1950m, 2300m, 2300m, 2700m, 2700m, 3150m, 3150m, 3150m, 3600m, 3600m, 3600m, 4050m, 4050m, 4450m, 4450m, 4850m, 4850m },
        new decimal[] { -900m, -1100m, -1350m, -1350m, -1650m, -1650m, -1950m, -1950m, -2300m, -2300m, -2700m, -2700m, -3150m, -3150m, -3150m, -3600m, -3600m, -3600m, -4050m, -4050m, -4450m, -4450m, -4850m, -4850m }
        );

        public static ПолеДопуска j7 = new ПолеДопуска(ОсновноеОтклонение.j, 7,
        new decimal[] { 3m, 6m, 10m, 14m, 18m, 24m, 30m, 40m, 50m, 65m, 80m, 100m, 120m, 140m, 160m, 180m, 200m, 225m, 250m, 280m, 315m, 355m, 400m, 450m, 500m, 560m },
        new decimal[] { 6m, 8m, 10m, 12m, 12m, 13m, 13m, 15m, 15m, 18m, 18m, 20m, 20m, 22m, 22m, 22m, 25m, 25m, 25m, 26m, 26m, 29m, 29m, 31m, 31m, 31m },
        new decimal[] { -4m, -4m, -5m, -6m, -6m, -8m, -8m, -10m, -10m, -12m, -12m, -15m, -15m, -18m, -18m, -18m, -21m, -21m, -21m, -26m, -26m, -28m, -28m, -32m, -32m, -32m }
        );

        public static ПолеДопуска B11 = new ПолеДопуска(ОсновноеОтклонение.B, 11,
        new decimal[] { 3m, 6m, 10m, 14m, 18m, 24m, 30m, 40m, 50m, 65m, 80m, 100m, 120m, 140m, 160m, 180m, 200m, 225m, 250m, 280m, 315m, 355m, 400m, 450m, 500m },
        new decimal[] { 200m, 215m, 240m, 260m, 260m, 290m, 290m, 330m, 340m, 380m, 390m, 440m, 460m, 510m, 530m, 560m, 630m, 670m, 710m, 800m, 860m, 960m, 1040m, 1160m, 1240m },
        new decimal[] { 140m, 140m, 150m, 150m, 150m, 160m, 160m, 170m, 180m, 190m, 200m, 220m, 240m, 260m, 280m, 310m, 340m, 380m, 420m, 480m, 540m, 600m, 680m, 760m, 840m }
        );

        public static ПолеДопуска js8 = new ПолеДопуска(ОсновноеОтклонение.js, 8,
        new decimal[] { 3m, 6m, 10m, 14m, 18m, 24m, 30m, 40m, 50m, 65m, 80m, 100m, 120m, 140m, 160m, 180m, 200m, 225m, 250m, 280m, 315m, 355m, 400m, 450m, 500m, 560m },
        new decimal[] { 7m, 9m, 11m, 13m, 13m, 16m, 16m, 19m, 19m, 23m, 23m, 27m, 27m, 31m, 31m, 31m, 36m, 36m, 36m, 40m, 40m, 44m, 44m, 48m, 48m, 55m },
        new decimal[] { -7m, -9m, -11m, -13m, -13m, -16m, -16m, -19m, -19m, -23m, -23m, -27m, -27m, -31m, -31m, -31m, -36m, -36m, -36m, -40m, -40m, -44m, -44m, -48m, -48m, -55m }
        );

        public static ПолеДопуска js11 = new ПолеДопуска(ОсновноеОтклонение.js, 11,
        new decimal[] { 3m, 6m, 10m, 14m, 18m, 24m, 30m, 40m, 50m, 65m, 80m, 100m, 120m, 140m, 160m, 180m, 200m, 225m, 250m, 280m, 315m, 355m, 400m, 450m, 500m, 560m },
        new decimal[] { 30m, 37m, 45m, 55m, 55m, 65m, 65m, 80m, 80m, 95m, 95m, 110m, 110m, 125m, 125m, 125m, 145m, 145m, 145m, 160m, 160m, 180m, 180m, 200m, 200m, 220m },
        new decimal[] { -30m, -37m, -45m, -55m, -55m, -65m, -65m, -80m, -80m, -95m, -95m, -110m, -110m, -125m, -125m, -125m, -145m, -145m, -145m, -160m, -160m, -180m, -180m, -200m, -200m, -220m }
        );

        public static ПолеДопуска x9 = new ПолеДопуска(ОсновноеОтклонение.x, 9,
        new decimal[] { 3m, 6m, 10m, 14m, 18m, 24m, 30m, 40m, 50m, 65m, 80m, 100m, 120m, 140m, 160m, 180m, 200m, 225m, 250m, 280m, 315m, 355m, 400m, 450m, 500m, 560m },
        new decimal[] { 45m, 58m, 70m, 83m, 88m, 106m, 116m, 142m, 159m, 196m, 220m, 265m, 297m, 348m, 380m, 410m, 465m, 500m, 540m, 605m, 655m, 730m, 800m, 895m, 975m, 975m },
        new decimal[] { 20m, 28m, 34m, 40m, 45m, 54m, 64m, 80m, 97m, 122m, 146m, 178m, 210m, 248m, 280m, 310m, 350m, 385m, 425m, 475m, 525m, 590m, 660m, 740m, 820m, 820m }
        );

        public static ПолеДопуска JS11 = new ПолеДопуска(ОсновноеОтклонение.JS, 11,
        new decimal[] { 3m, 6m, 10m, 14m, 18m, 24m, 30m, 40m, 50m, 65m, 80m, 100m, 120m, 140m, 160m, 180m, 200m, 225m, 250m, 280m, 315m, 355m, 400m, 450m, 500m },
        new decimal[] { 30m, 37m, 45m, 55m, 55m, 65m, 65m, 80m, 80m, 95m, 95m, 110m, 110m, 125m, 125m, 125m, 145m, 145m, 145m, 160m, 160m, 180m, 180m, 200m, 200m },
        new decimal[] { -30m, -37m, -45m, -55m, -55m, -65m, -65m, -80m, -80m, -95m, -95m, -110m, -110m, -125m, -125m, -125m, -145m, -145m, -145m, -160m, -160m, -180m, -180m, -200m, -200m }
        );

        public static ПолеДопуска z7 = new ПолеДопуска(ОсновноеОтклонение.z, 7,
        new decimal[] { 3m, 6m, 10m, 14m, 18m, 24m, 30m, 40m, 50m, 65m, 80m, 100m, 120m, 140m, 160m, 180m, 200m, 225m, 250m, 280m, 315m, 355m, 400m, 450m, 500m, 560m },
        new decimal[] { 36m, 47m, 57m, 68m, 78m, 94m, 109m, 137m, 161m, 202m, 240m, 293m, 345m, 405m, 455m, 505m, 566m, 621m, 686m, 762m, 842m, 957m, 1057m, 1163m, 1313m, 1313m },
        new decimal[] { 26m, 35m, 42m, 50m, 60m, 73m, 88m, 112m, 136m, 172m, 210m, 258m, 310m, 365m, 415m, 465m, 520m, 575m, 640m, 710m, 790m, 900m, 1000m, 1100m, 1250m, 1250m }
        );

        public static ПолеДопуска m6 = new ПолеДопуска(ОсновноеОтклонение.m, 6,
        new decimal[] { 3m, 6m, 10m, 14m, 18m, 24m, 30m, 40m, 50m, 65m, 80m, 100m, 120m, 140m, 160m, 180m, 200m, 225m, 250m, 280m, 315m, 355m, 400m, 450m, 500m, 560m },
        new decimal[] { 8m, 12m, 15m, 18m, 18m, 21m, 21m, 25m, 25m, 30m, 30m, 35m, 35m, 40m, 40m, 40m, 46m, 46m, 46m, 52m, 52m, 57m, 57m, 63m, 63m, 70m },
        new decimal[] { 2m, 4m, 6m, 7m, 7m, 8m, 8m, 9m, 9m, 11m, 11m, 13m, 13m, 15m, 15m, 15m, 17m, 17m, 17m, 20m, 20m, 21m, 21m, 23m, 23m, 26m }
        );

        public static ПолеДопуска U7 = new ПолеДопуска(ОсновноеОтклонение.U, 7,
        new decimal[] { 3m, 6m, 10m, 14m, 18m, 24m, 30m, 40m, 50m, 65m, 80m, 100m, 120m, 140m, 160m, 180m, 200m, 225m, 250m, 280m, 315m, 355m, 400m, 450m, 500m },
        new decimal[] { -18m, -19m, -22m, -26m, -26m, -33m, -40m, -51m, -61m, -76m, -91m, -111m, -131m, -155m, -175m, -195m, -219m, -241m, -267m, -295m, -330m, -369m, -414m, -467m, -517m },
        new decimal[] { -28m, -31m, -37m, -44m, -44m, -54m, -61m, -76m, -86m, -106m, -121m, -146m, -166m, -195m, -215m, -235m, -265m, -287m, -313m, -347m, -382m, -426m, -471m, -530m, -580m }
        );

        public static ПолеДопуска p6 = new ПолеДопуска(ОсновноеОтклонение.p, 6,
        new decimal[] { 3m, 6m, 10m, 14m, 18m, 24m, 30m, 40m, 50m, 65m, 80m, 100m, 120m, 140m, 160m, 180m, 200m, 225m, 250m, 280m, 315m, 355m, 400m, 450m, 500m, 560m },
        new decimal[] { 12m, 20m, 24m, 29m, 29m, 35m, 35m, 42m, 42m, 51m, 51m, 59m, 59m, 68m, 68m, 68m, 79m, 79m, 79m, 88m, 88m, 98m, 98m, 108m, 108m, 122m },
        new decimal[] { 6m, 12m, 15m, 18m, 18m, 22m, 22m, 26m, 26m, 32m, 32m, 37m, 37m, 43m, 43m, 43m, 50m, 50m, 50m, 56m, 56m, 62m, 62m, 68m, 68m, 78m }
        );

        public static ПолеДопуска k7 = new ПолеДопуска(ОсновноеОтклонение.k, 7,
        new decimal[] { 3m, 6m, 10m, 14m, 18m, 24m, 30m, 40m, 50m, 65m, 80m, 100m, 120m, 140m, 160m, 180m, 200m, 225m, 250m, 280m, 315m, 355m, 400m, 450m, 500m, 560m },
        new decimal[] { 10m, 13m, 16m, 19m, 19m, 23m, 23m, 27m, 27m, 32m, 32m, 38m, 38m, 43m, 43m, 43m, 50m, 50m, 50m, 56m, 56m, 61m, 61m, 68m, 68m, 70m },
        new decimal[] { 0m, 1m, 1m, 1m, 1m, 2m, 2m, 2m, 2m, 2m, 2m, 3m, 3m, 3m, 3m, 3m, 4m, 4m, 4m, 4m, 4m, 4m, 4m, 5m, 5m, 0m }
        );

        public static ПолеДопуска n6 = new ПолеДопуска(ОсновноеОтклонение.n, 6,
        new decimal[] { 3m, 6m, 10m, 14m, 18m, 24m, 30m, 40m, 50m, 65m, 80m, 100m, 120m, 140m, 160m, 180m, 200m, 225m, 250m, 280m, 315m, 355m, 400m, 450m, 500m, 560m },
        new decimal[] { 10m, 16m, 19m, 23m, 23m, 28m, 28m, 33m, 33m, 39m, 39m, 45m, 45m, 52m, 52m, 52m, 60m, 60m, 60m, 66m, 66m, 73m, 73m, 80m, 80m, 88m },
        new decimal[] { 4m, 8m, 10m, 12m, 12m, 15m, 15m, 17m, 17m, 20m, 20m, 23m, 23m, 27m, 27m, 27m, 31m, 31m, 31m, 34m, 34m, 37m, 37m, 40m, 40m, 44m }
        );

        public static ПолеДопуска JS5 = new ПолеДопуска(ОсновноеОтклонение.JS, 5,
        new decimal[] { 3m, 6m, 10m, 14m, 18m, 24m, 30m, 40m, 50m, 65m, 80m, 100m, 120m, 140m, 160m, 180m, 200m, 225m, 250m, 280m, 315m, 355m, 400m, 450m, 500m },
        new decimal[] { 2m, 2.5m, 3m, 4m, 4m, 4.5m, 4.5m, 5.5m, 5.5m, 6.5m, 6.5m, 7.5m, 7.5m, 9m, 9m, 9m, 10m, 10m, 10m, 11.5m, 11.5m, 12.5m, 12.5m, 13.5m, 13.5m },
        new decimal[] { -2m, -2.5m, -3m, -4m, -4m, -4.5m, -4.5m, -5.5m, -5.5m, -6.5m, -6.5m, -7.5m, -7.5m, -9m, -9m, -9m, -10m, -10m, -10m, -11.5m, -11.5m, -12.5m, -12.5m, -13.5m, -13.5m }
        );

        public static ПолеДопуска JS15 = new ПолеДопуска(ОсновноеОтклонение.JS, 15,
        new decimal[] { 3m, 6m, 10m, 14m, 18m, 24m, 30m, 40m, 50m, 65m, 80m, 100m, 120m, 140m, 160m, 180m, 200m, 225m, 250m, 280m, 315m, 355m, 400m, 450m, 500m },
        new decimal[] { 200m, 240m, 290m, 350m, 350m, 420m, 420m, 500m, 500m, 600m, 600m, 700m, 700m, 800m, 800m, 800m, 925m, 925m, 925m, 1050m, 1050m, 1150m, 1150m, 1250m, 1250m },
        new decimal[] { -200m, -240m, -290m, -350m, -350m, -420m, -420m, -500m, -500m, -600m, -600m, -700m, -700m, -800m, -800m, -800m, -925m, -925m, -925m, -1050m, -1050m, -1150m, -1150m, -1250m, -1250m }
        );

        public static ПолеДопуска ef8 = new ПолеДопуска(ОсновноеОтклонение.ef, 8,
        new decimal[] { 3m, 6m, 10m },
        new decimal[] { -10m, -14m, -18m },
        new decimal[] { -24m, -32m, -40m }
        );

        public static ПолеДопуска zb8 = new ПолеДопуска(ОсновноеОтклонение.zb, 8,
        new decimal[] { 3m, 6m, 10m, 14m, 18m },
        new decimal[] { 54m, 68m, 89m, 117m, 135m },
        new decimal[] { 40m, 50m, 67m, 90m, 108m }
        );

        public static ПолеДопуска JS10 = new ПолеДопуска(ОсновноеОтклонение.JS, 10,
        new decimal[] { 3m, 6m, 10m, 14m, 18m, 24m, 30m, 40m, 50m, 65m, 80m, 100m, 120m, 140m, 160m, 180m, 200m, 225m, 250m, 280m, 315m, 355m, 400m, 450m, 500m },
        new decimal[] { 20m, 24m, 29m, 35m, 35m, 42m, 42m, 50m, 50m, 60m, 60m, 70m, 70m, 80m, 80m, 80m, 92m, 92m, 92m, 105m, 105m, 115m, 115m, 125m, 125m },
        new decimal[] { -20m, -24m, -29m, -35m, -35m, -42m, -42m, -50m, -50m, -60m, -60m, -70m, -70m, -80m, -80m, -80m, -92m, -92m, -92m, -105m, -105m, -115m, -115m, -125m, -125m }
        );

        public static ПолеДопуска d10 = new ПолеДопуска(ОсновноеОтклонение.d, 10,
        new decimal[] { 3m, 6m, 10m, 14m, 18m, 24m, 30m, 40m, 50m, 65m, 80m, 100m, 120m, 140m, 160m, 180m, 200m, 225m, 250m, 280m, 315m, 355m, 400m, 450m, 500m, 560m },
        new decimal[] { -20m, -30m, -40m, -50m, -50m, -65m, -65m, -80m, -80m, -100m, -100m, -120m, -120m, -145m, -145m, -145m, -170m, -170m, -170m, -190m, -190m, -210m, -210m, -230m, -230m, -260m },
        new decimal[] { -60m, -78m, -98m, -120m, -120m, -149m, -149m, -180m, -180m, -220m, -220m, -260m, -260m, -305m, -305m, -305m, -355m, -355m, -355m, -400m, -400m, -440m, -440m, -480m, -480m, -540m }
        );

        public static ПолеДопуска m4 = new ПолеДопуска(ОсновноеОтклонение.m, 4,
        new decimal[] { 3m, 6m, 10m, 14m, 18m, 24m, 30m, 40m, 50m, 65m, 80m, 100m, 120m, 140m, 160m, 180m, 200m, 225m, 250m, 280m, 315m, 355m, 400m, 450m, 500m, 560m },
        new decimal[] { 5m, 8m, 10m, 12m, 12m, 14m, 14m, 16m, 16m, 19m, 19m, 23m, 23m, 27m, 27m, 27m, 31m, 31m, 31m, 36m, 36m, 39m, 39m, 43m, 43m, 48m },
        new decimal[] { 2m, 4m, 6m, 7m, 7m, 8m, 8m, 9m, 9m, 11m, 11m, 13m, 13m, 15m, 15m, 15m, 17m, 17m, 17m, 20m, 20m, 21m, 21m, 23m, 23m, 26m }
        );

        public static ПолеДопуска js7 = new ПолеДопуска(ОсновноеОтклонение.js, 7,
        new decimal[] { 3m, 6m, 10m, 14m, 18m, 24m, 30m, 40m, 50m, 65m, 80m, 100m, 120m, 140m, 160m, 180m, 200m, 225m, 250m, 280m, 315m, 355m, 400m, 450m, 500m, 560m },
        new decimal[] { 5m, 6m, 7m, 9m, 9m, 10m, 10m, 12m, 12m, 15m, 15m, 17m, 17m, 20m, 20m, 20m, 23m, 23m, 23m, 26m, 26m, 28m, 28m, 31m, 31m, 35m },
        new decimal[] { -5m, -6m, -7m, -9m, -9m, -10m, -10m, -12m, -12m, -15m, -15m, -17m, -17m, -20m, -20m, -20m, -23m, -23m, -23m, -26m, -26m, -28m, -28m, -31m, -31m, -35m }
        );

        public static ПолеДопуска r5 = new ПолеДопуска(ОсновноеОтклонение.r, 5,
        new decimal[] { 3m, 6m, 10m, 14m, 18m, 24m, 30m, 40m, 50m, 65m, 80m, 100m, 120m, 140m, 160m, 180m, 200m, 225m, 250m, 280m, 315m, 355m, 400m, 450m, 500m, 560m },
        new decimal[] { 14m, 20m, 25m, 31m, 31m, 37m, 37m, 45m, 45m, 54m, 56m, 66m, 69m, 81m, 83m, 86m, 97m, 100m, 104m, 117m, 121m, 133m, 139m, 153m, 159m, 180m },
        new decimal[] { 10m, 15m, 19m, 23m, 23m, 28m, 28m, 34m, 34m, 41m, 43m, 51m, 54m, 63m, 65m, 68m, 77m, 80m, 84m, 94m, 98m, 108m, 114m, 126m, 132m, 150m }
        );

        public static ПолеДопуска JS18 = new ПолеДопуска(ОсновноеОтклонение.JS, 18,
        new decimal[] { 6m, 10m, 14m, 18m, 24m, 30m, 40m, 50m, 65m, 80m, 100m, 120m, 140m, 160m, 180m, 200m, 225m, 250m, 280m, 315m, 355m, 400m, 450m, 500m },
        new decimal[] { 900m, 1100m, 1350m, 1350m, 1650m, 1650m, 1950m, 1950m, 2300m, 2300m, 2700m, 2700m, 3150m, 3150m, 3150m, 3600m, 3600m, 3600m, 4050m, 4050m, 4450m, 4450m, 4850m, 4850m },
        new decimal[] { -900m, -1100m, -1350m, -1350m, -1650m, -1650m, -1950m, -1950m, -2300m, -2300m, -2700m, -2700m, -3150m, -3150m, -3150m, -3600m, -3600m, -3600m, -4050m, -4050m, -4450m, -4450m, -4850m, -4850m }
        );

        public static ПолеДопуска JS8 = new ПолеДопуска(ОсновноеОтклонение.JS, 8,
        new decimal[] { 3m, 6m, 10m, 14m, 18m, 24m, 30m, 40m, 50m, 65m, 80m, 100m, 120m, 140m, 160m, 180m, 200m, 225m, 250m, 280m, 315m, 355m, 400m, 450m, 500m },
        new decimal[] { 7m, 9m, 11m, 13m, 13m, 16m, 16m, 19m, 19m, 23m, 23m, 27m, 27m, 31m, 31m, 31m, 36m, 36m, 36m, 40m, 40m, 44m, 44m, 48m, 48m },
        new decimal[] { -7m, -9m, -11m, -13m, -13m, -16m, -16m, -19m, -19m, -23m, -23m, -27m, -27m, -31m, -31m, -31m, -36m, -36m, -36m, -40m, -40m, -44m, -44m, -48m, -48m }
        );

        public static ПолеДопуска F8 = new ПолеДопуска(ОсновноеОтклонение.F, 8,
        new decimal[] { 3m, 6m, 10m, 14m, 18m, 24m, 30m, 40m, 50m, 65m, 80m, 100m, 120m, 140m, 160m, 180m, 200m, 225m, 250m, 280m, 315m, 355m, 400m, 450m, 500m },
        new decimal[] { 20m, 28m, 35m, 43m, 43m, 53m, 53m, 64m, 64m, 76m, 76m, 90m, 90m, 106m, 106m, 106m, 122m, 122m, 122m, 137m, 137m, 151m, 151m, 165m, 165m },
        new decimal[] { 6m, 10m, 13m, 16m, 16m, 20m, 20m, 25m, 25m, 30m, 30m, 36m, 36m, 43m, 43m, 43m, 50m, 50m, 50m, 56m, 56m, 62m, 62m, 68m, 68m }
        );

        public static ПолеДопуска x6 = new ПолеДопуска(ОсновноеОтклонение.x, 6,
        new decimal[] { 3m, 6m, 10m, 14m, 18m, 24m, 30m, 40m, 50m, 65m, 80m, 100m, 120m, 140m, 160m, 180m, 200m, 225m, 250m, 280m, 315m, 355m, 400m, 450m, 500m, 560m },
        new decimal[] { 26m, 36m, 43m, 51m, 56m, 67m, 77m, 96m, 113m, 141m, 165m, 200m, 232m, 273m, 305m, 335m, 379m, 414m, 454m, 507m, 557m, 626m, 696m, 780m, 860m, 860m },
        new decimal[] { 20m, 28m, 34m, 40m, 45m, 54m, 64m, 80m, 97m, 122m, 146m, 178m, 210m, 248m, 280m, 310m, 350m, 385m, 425m, 475m, 525m, 590m, 660m, 740m, 820m, 820m }
        );

        public static ПолеДопуска JS14 = new ПолеДопуска(ОсновноеОтклонение.JS, 14,
        new decimal[] { 3m, 6m, 10m, 14m, 18m, 24m, 30m, 40m, 50m, 65m, 80m, 100m, 120m, 140m, 160m, 180m, 200m, 225m, 250m, 280m, 315m, 355m, 400m, 450m, 500m },
        new decimal[] { 125m, 150m, 180m, 215m, 215m, 260m, 260m, 310m, 310m, 370m, 370m, 435m, 435m, 500m, 500m, 500m, 575m, 575m, 575m, 650m, 650m, 700m, 700m, 775m, 775m },
        new decimal[] { -125m, -150m, -180m, -215m, -215m, -260m, -260m, -310m, -310m, -370m, -370m, -435m, -435m, -500m, -500m, -500m, -575m, -575m, -575m, -650m, -650m, -700m, -700m, -775m, -775m }
        );

        public static ПолеДопуска js4 = new ПолеДопуска(ОсновноеОтклонение.js, 4,
        new decimal[] { 3m, 6m, 10m, 14m, 18m, 24m, 30m, 40m, 50m, 65m, 80m, 100m, 120m, 140m, 160m, 180m, 200m, 225m, 250m, 280m, 315m, 355m, 400m, 450m, 500m, 560m },
        new decimal[] { 1.5m, 2m, 2m, 2.5m, 2.5m, 3m, 3m, 3.5m, 3.5m, 4m, 4m, 5m, 5m, 6m, 6m, 6m, 7m, 7m, 7m, 8m, 8m, 9m, 9m, 10m, 10m, 11m },
        new decimal[] { -1.5m, -2m, -2m, -2.5m, -2.5m, -3m, -3m, -3.5m, -3.5m, -4m, -4m, -5m, -5m, -6m, -6m, -6m, -7m, -7m, -7m, -8m, -8m, -9m, -9m, -10m, -10m, -11m }
        );

        public static ПолеДопуска h13 = new ПолеДопуска(ОсновноеОтклонение.h, 13,
        new decimal[] { 3m, 6m, 10m, 14m, 18m, 24m, 30m, 40m, 50m, 65m, 80m, 100m, 120m, 140m, 160m, 180m, 200m, 225m, 250m, 280m, 315m, 355m, 400m, 450m, 500m, 560m },
        new decimal[] { 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m },
        new decimal[] { -140m, -180m, -220m, -270m, -270m, -330m, -330m, -390m, -390m, -460m, -460m, -540m, -540m, -630m, -630m, -630m, -720m, -720m, -720m, -810m, -810m, -890m, -890m, -970m, -970m, -1100m }
        );

        public static ПолеДопуска ef7 = new ПолеДопуска(ОсновноеОтклонение.ef, 7,
        new decimal[] { 3m, 6m, 10m },
        new decimal[] { -10m, -14m, -18m },
        new decimal[] { -20m, -26m, -33m }
        );

        public static ПолеДопуска H9 = new ПолеДопуска(ОсновноеОтклонение.H, 9,
        new decimal[] { 3m, 6m, 10m, 14m, 18m, 24m, 30m, 40m, 50m, 65m, 80m, 100m, 120m, 140m, 160m, 180m, 200m, 225m, 250m, 280m, 315m, 355m, 400m, 450m, 500m },
        new decimal[] { 25m, 30m, 36m, 43m, 43m, 52m, 52m, 62m, 62m, 74m, 74m, 87m, 87m, 100m, 100m, 100m, 115m, 115m, 115m, 130m, 130m, 140m, 140m, 155m, 155m },
        new decimal[] { 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m }
        );

        public static ПолеДопуска EF8 = new ПолеДопуска(ОсновноеОтклонение.EF, 8,
        new decimal[] { 3m, 6m, 10m },
        new decimal[] { 24m, 32m, 40m },
        new decimal[] { 10m, 14m, 18m }
        );

        public static ПолеДопуска u6 = new ПолеДопуска(ОсновноеОтклонение.u, 6,
        new decimal[] { 3m, 6m, 10m, 14m, 18m, 24m, 30m, 40m, 50m, 65m, 80m, 100m, 120m, 140m, 160m, 180m, 200m, 225m, 250m, 280m, 315m, 355m, 400m, 450m, 500m, 560m },
        new decimal[] { 24m, 31m, 37m, 44m, 44m, 54m, 61m, 76m, 86m, 106m, 121m, 146m, 166m, 195m, 215m, 235m, 265m, 287m, 313m, 347m, 382m, 426m, 471m, 530m, 580m, 644m },
        new decimal[] { 18m, 23m, 28m, 33m, 33m, 41m, 48m, 60m, 70m, 87m, 102m, 124m, 144m, 170m, 190m, 210m, 236m, 258m, 284m, 315m, 350m, 390m, 435m, 490m, 540m, 600m }
        );

        public static ПолеДопуска N8 = new ПолеДопуска(ОсновноеОтклонение.N, 8,
        new decimal[] { 3m, 6m, 10m, 14m, 18m, 24m, 30m, 40m, 50m, 65m, 80m, 100m, 120m, 140m, 160m, 180m, 200m, 225m, 250m, 280m, 315m, 355m, 400m, 450m, 500m },
        new decimal[] { -4m, -2m, -3m, -3m, -3m, -3m, -3m, -3m, -3m, -4m, -4m, -4m, -4m, -4m, -4m, -4m, -5m, -5m, -5m, -5m, -5m, -5m, -5m, -6m, -6m },
        new decimal[] { -18m, -20m, -25m, -30m, -30m, -36m, -36m, -42m, -42m, -50m, -50m, -58m, -58m, -67m, -67m, -67m, -77m, -77m, -77m, -86m, -86m, -94m, -94m, -103m, -103m }
        );

        public static ПолеДопуска p4 = new ПолеДопуска(ОсновноеОтклонение.p, 4,
        new decimal[] { 3m, 6m, 10m, 14m, 18m, 24m, 30m, 40m, 50m, 65m, 80m, 100m, 120m, 140m, 160m, 180m, 200m, 225m, 250m, 280m, 315m, 355m, 400m, 450m, 500m, 560m },
        new decimal[] { 9m, 16m, 19m, 23m, 23m, 28m, 28m, 33m, 33m, 40m, 40m, 47m, 47m, 55m, 55m, 55m, 64m, 64m, 64m, 72m, 72m, 80m, 80m, 88m, 88m, 100m },
        new decimal[] { 6m, 12m, 15m, 18m, 18m, 22m, 22m, 26m, 26m, 32m, 32m, 37m, 37m, 43m, 43m, 43m, 50m, 50m, 50m, 56m, 56m, 62m, 62m, 68m, 68m, 78m }
        );

        public static ПолеДопуска h10 = new ПолеДопуска(ОсновноеОтклонение.h, 10,
        new decimal[] { 3m, 6m, 10m, 14m, 18m, 24m, 30m, 40m, 50m, 65m, 80m, 100m, 120m, 140m, 160m, 180m, 200m, 225m, 250m, 280m, 315m, 355m, 400m, 450m, 500m, 560m },
        new decimal[] { 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m },
        new decimal[] { -40m, -48m, -58m, -70m, -70m, -84m, -84m, -100m, -100m, -120m, -120m, -140m, -140m, -160m, -160m, -160m, -185m, -185m, -185m, -210m, -210m, -230m, -230m, -250m, -250m, -280m }
        );

        public static ПолеДопуска JS7 = new ПолеДопуска(ОсновноеОтклонение.JS, 7,
        new decimal[] { 3m, 6m, 10m, 14m, 18m, 24m, 30m, 40m, 50m, 65m, 80m, 100m, 120m, 140m, 160m, 180m, 200m, 225m, 250m, 280m, 315m, 355m, 400m, 450m, 500m },
        new decimal[] { 5m, 6m, 7m, 9m, 9m, 10m, 10m, 12m, 12m, 15m, 15m, 17m, 17m, 20m, 20m, 20m, 23m, 23m, 23m, 26m, 26m, 28m, 28m, 31m, 31m },
        new decimal[] { -5m, -6m, -7m, -9m, -9m, -10m, -10m, -12m, -12m, -15m, -15m, -17m, -17m, -20m, -20m, -20m, -23m, -23m, -23m, -26m, -26m, -28m, -28m, -31m, -31m }
        );

        public static ПолеДопуска D11 = new ПолеДопуска(ОсновноеОтклонение.D, 11,
        new decimal[] { 3m, 6m, 10m, 14m, 18m, 24m, 30m, 40m, 50m, 65m, 80m, 100m, 120m, 140m, 160m, 180m, 200m, 225m, 250m, 280m, 315m, 355m, 400m, 450m, 500m },
        new decimal[] { 80m, 105m, 130m, 160m, 160m, 195m, 195m, 240m, 240m, 290m, 290m, 340m, 340m, 395m, 395m, 395m, 460m, 460m, 460m, 510m, 510m, 570m, 570m, 630m, 630m },
        new decimal[] { 20m, 30m, 40m, 50m, 50m, 65m, 65m, 80m, 80m, 100m, 100m, 120m, 120m, 145m, 145m, 145m, 170m, 170m, 170m, 190m, 190m, 210m, 210m, 230m, 230m }
        );           

        public static ПолеДопуска H15 = new ПолеДопуска(ОсновноеОтклонение.H, 15,
        new decimal[] { 3m, 6m, 10m, 14m, 18m, 24m, 30m, 40m, 50m, 65m, 80m, 100m, 120m, 140m, 160m, 180m, 200m, 225m, 250m, 280m, 315m, 355m, 400m, 450m, 500m },
        new decimal[] { 400m, 400m, 580m, 700m, 700m, 840m, 840m, 1000m, 1000m, 1200m, 1200m, 1400m, 1400m, 1600m, 1600m, 1600m, 1850m, 1850m, 1850m, 2100m, 2100m, 2300m, 2300m, 2500m, 2500m },
        new decimal[] { 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m }
        );

        public static ПолеДопуска js12 = new ПолеДопуска(ОсновноеОтклонение.js, 12,
        new decimal[] { 3m, 6m, 10m, 14m, 18m, 24m, 30m, 40m, 50m, 65m, 80m, 100m, 120m, 140m, 160m, 180m, 200m, 225m, 250m, 280m, 315m, 355m, 400m, 450m, 500m, 560m },
        new decimal[] { 50m, 60m, 75m, 90m, 90m, 105m, 105m, 125m, 125m, 150m, 150m, 175m, 175m, 200m, 200m, 200m, 230m, 230m, 230m, 260m, 260m, 285m, 285m, 315m, 315m, 350m },
        new decimal[] { -50m, -60m, -75m, -90m, -90m, -105m, -105m, -125m, -125m, -150m, -150m, -175m, -175m, -200m, -200m, -200m, -230m, -230m, -230m, -260m, -260m, -285m, -285m, -315m, -315m, -350m }
        );

        public static ПолеДопуска JS4 = new ПолеДопуска(ОсновноеОтклонение.JS, 4,
        new decimal[] { 3m, 6m, 10m, 14m, 18m, 24m, 30m, 40m, 50m, 65m, 80m, 100m, 120m, 140m, 160m, 180m, 200m, 225m, 250m, 280m, 315m, 355m, 400m, 450m, 500m },
        new decimal[] { 1.5m, 2m, 2m, 2.5m, 2.5m, 3m, 3m, 3.5m, 3.5m, 4m, 4m, 5m, 5m, 6m, 6m, 6m, 7m, 7m, 7m, 8m, 8m, 9m, 9m, 10m, 10m },
        new decimal[] { -1.5m, -2m, -2m, -2.5m, -2.5m, -3m, -3m, -3.5m, -3.5m, -4m, -4m, -5m, -5m, -6m, -6m, -6m, -7m, -7m, -7m, -8m, -8m, -9m, -9m, -10m, -10m }
        );

        public static ПолеДопуска u5 = new ПолеДопуска(ОсновноеОтклонение.u, 5,
        new decimal[] { 3m, 6m, 10m, 14m, 18m, 24m, 30m, 40m, 50m, 65m, 80m, 100m, 120m, 140m, 160m, 180m, 200m, 225m, 250m, 280m, 315m, 355m, 400m, 450m, 500m, 560m },
        new decimal[] { 22m, 28m, 34m, 41m, 41m, 50m, 57m, 71m, 81m, 100m, 115m, 139m, 159m, 188m, 208m, 228m, 256m, 278m, 304m, 338m, 373m, 415m, 460m, 517m, 567m, 630m },
        new decimal[] { 18m, 23m, 28m, 33m, 33m, 41m, 48m, 60m, 70m, 87m, 102m, 124m, 144m, 170m, 190m, 210m, 236m, 258m, 284m, 315m, 350m, 390m, 435m, 490m, 540m, 600m }
        );

        public static ПолеДопуска m7 = new ПолеДопуска(ОсновноеОтклонение.m, 7,
        new decimal[] { 3m, 6m, 10m, 14m, 18m, 24m, 30m, 40m, 50m, 65m, 80m, 100m, 120m, 140m, 160m, 180m, 200m, 225m, 250m, 280m, 315m, 355m, 400m, 450m, 500m, 560m },
        new decimal[] { 0m, 16m, 21m, 25m, 25m, 29m, 29m, 34m, 34m, 41m, 41m, 48m, 48m, 55m, 55m, 55m, 63m, 63m, 63m, 72m, 72m, 78m, 78m, 86m, 86m, 96m },
        new decimal[] { 0m, 4m, 6m, 7m, 7m, 8m, 8m, 9m, 9m, 11m, 11m, 13m, 13m, 15m, 15m, 15m, 17m, 17m, 17m, 20m, 20m, 21m, 21m, 23m, 23m, 26m }
        );

        public static ПолеДопуска D8 = new ПолеДопуска(ОсновноеОтклонение.D, 8,
        new decimal[] { 3m, 6m, 10m, 14m, 18m, 24m, 30m, 40m, 50m, 65m, 80m, 100m, 120m, 140m, 160m, 180m, 200m, 225m, 250m, 280m, 315m, 355m, 400m, 450m, 500m },
        new decimal[] { 34m, 48m, 62m, 77m, 77m, 98m, 98m, 119m, 119m, 146m, 146m, 174m, 174m, 208m, 208m, 208m, 242m, 242m, 242m, 271m, 271m, 299m, 299m, 327m, 327m },
        new decimal[] { 20m, 30m, 40m, 50m, 50m, 65m, 65m, 80m, 80m, 100m, 100m, 120m, 120m, 145m, 145m, 145m, 170m, 170m, 170m, 190m, 190m, 210m, 210m, 230m, 230m }
        );

        public static ПолеДопуска n5 = new ПолеДопуска(ОсновноеОтклонение.n, 5,
        new decimal[] { 3m, 6m, 10m, 14m, 18m, 24m, 30m, 40m, 50m, 65m, 80m, 100m, 120m, 140m, 160m, 180m, 200m, 225m, 250m, 280m, 315m, 355m, 400m, 450m, 500m, 560m },
        new decimal[] { 8m, 13m, 16m, 20m, 20m, 24m, 24m, 28m, 28m, 33m, 33m, 38m, 38m, 45m, 45m, 45m, 51m, 51m, 51m, 57m, 57m, 62m, 62m, 67m, 67m, 74m },
        new decimal[] { 4m, 8m, 10m, 12m, 12m, 15m, 15m, 17m, 17m, 20m, 20m, 23m, 23m, 27m, 27m, 27m, 31m, 31m, 31m, 34m, 34m, 37m, 37m, 40m, 40m, 44m }
        );

        public static ПолеДопуска js10 = new ПолеДопуска(ОсновноеОтклонение.js, 10,
        new decimal[] { 3m, 6m, 10m, 14m, 18m, 24m, 30m, 40m, 50m, 65m, 80m, 100m, 120m, 140m, 160m, 180m, 200m, 225m, 250m, 280m, 315m, 355m, 400m, 450m, 500m, 560m },
        new decimal[] { 20m, 24m, 29m, 35m, 35m, 42m, 42m, 50m, 50m, 60m, 60m, 70m, 70m, 80m, 80m, 80m, 92m, 92m, 92m, 105m, 105m, 115m, 115m, 125m, 125m, 140m },
        new decimal[] { -20m, -24m, -29m, -35m, -35m, -42m, -42m, -50m, -50m, -60m, -60m, -70m, -70m, -80m, -80m, -80m, -92m, -92m, -92m, -105m, -105m, -115m, -115m, -125m, -125m, -140m }
        );

        public static ПолеДопуска H12 = new ПолеДопуска(ОсновноеОтклонение.H, 12,
        new decimal[] { 3m, 6m, 10m, 14m, 18m, 24m, 30m, 40m, 50m, 65m, 80m, 100m, 120m, 140m, 160m, 180m, 200m, 225m, 250m, 280m, 315m, 355m, 400m, 450m, 500m },
        new decimal[] { 100m, 120m, 150m, 180m, 180m, 210m, 210m, 250m, 250m, 300m, 300m, 350m, 350m, 400m, 400m, 400m, 460m, 460m, 460m, 520m, 520m, 570m, 570m, 630m, 630m },
        new decimal[] { 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m }
        );

        public static ПолеДопуска EF7 = new ПолеДопуска(ОсновноеОтклонение.EF, 7,
        new decimal[] { 3m, 6m, 10m },
        new decimal[] { 20m, 26m, 33m },
        new decimal[] { 10m, 14m, 18m }
        );

        public static ПолеДопуска js6 = new ПолеДопуска(ОсновноеОтклонение.js, 6,
        new decimal[] { 3m, 6m, 10m, 14m, 18m, 24m, 30m, 40m, 50m, 65m, 80m, 100m, 120m, 140m, 160m, 180m, 200m, 225m, 250m, 280m, 315m, 355m, 400m, 450m, 500m, 560m },
        new decimal[] { 3m, 4m, 4.5m, 5.5m, 5.5m, 6.5m, 6.5m, 8m, 8m, 9.5m, 9.5m, 11m, 11m, 12.5m, 12.5m, 12.5m, 14.5m, 14.5m, 14.5m, 16m, 16m, 18m, 18m, 20m, 20m, 22m },
        new decimal[] { -3m, -4m, -4.5m, -5.5m, -5.5m, -6.5m, -6.5m, -8m, -8m, -9.5m, -9.5m, -11m, -11m, -12.5m, -12.5m, -12.5m, -14.5m, -14.5m, -14.5m, -16m, -16m, -18m, -18m, -20m, -20m, -22m }
        );

        public static ПолеДопуска js16 = new ПолеДопуска(ОсновноеОтклонение.js, 16,
        new decimal[] { 3m, 6m, 10m, 14m, 18m, 24m, 24m, 40m, 50m, 65m, 80m, 100m, 120m, 140m, 160m, 180m, 200m, 225m, 250m, 280m, 315m, 355m, 400m, 450m, 500m },
        new decimal[] { 300m, 375m, 450m, 550m, 550m, 650m, 650m, 800m, 800m, 950m, 950m, 1100m, 1100m, 1250m, 1250m, 1250m, 1450m, 1450m, 1450m, 1600m, 1600m, 1800m, 1800m, 2000m, 2000m },
        new decimal[] { -300m, -375m, -450m, -550m, -550m, -650m, -650m, -800m, -800m, -950m, -950m, -1100m, -1100m, -1250m, -1250m, -1250m, -1450m, -1450m, -1450m, -1600m, -1600m, -1800m, -1800m, -2000m, -2000m }
        );

        public static ПолеДопуска B12 = new ПолеДопуска(ОсновноеОтклонение.B, 12,
        new decimal[] { 3m, 6m, 10m, 14m, 18m, 24m, 30m, 40m, 50m, 65m, 80m, 100m, 120m, 140m, 160m, 180m, 200m, 225m, 250m, 280m, 315m, 355m, 400m, 450m, 500m },
        new decimal[] { 240m, 260m, 300m, 330m, 330m, 370m, 370m, 420m, 430m, 490m, 500m, 570m, 590m, 660m, 680m, 710m, 800m, 840m, 880m, 1000m, 1060m, 1170m, 1250m, 1390m, 1470m },
        new decimal[] { 140m, 140m, 150m, 150m, 150m, 160m, 160m, 170m, 180m, 190m, 200m, 220m, 240m, 260m, 280m, 310m, 340m, 380m, 420m, 480m, 540m, 600m, 680m, 760m, 840m }
        );

        public static ПолеДопуска C12 = new ПолеДопуска(ОсновноеОтклонение.C, 12,
        new decimal[] { 3m, 6m, 10m, 14m, 18m, 24m, 30m, 40m, 50m, 65m, 80m, 100m, 120m, 140m, 160m, 180m, 200m, 225m, 250m, 280m, 315m, 355m, 400m, 450m, 500m },
        new decimal[] { 160m, 190m, 230m, 275m, 275m, 320m, 320m, 370m, 380m, 440m, 450m, 520m, 530m, 600m, 610m, 630m, 700m, 720m, 740m, 820m, 850m, 930m, 970m, 1070m, 1110m },
        new decimal[] { 60m, 70m, 80m, 95m, 95m, 110m, 110m, 120m, 130m, 140m, 150m, 170m, 180m, 200m, 210m, 230m, 240m, 260m, 280m, 300m, 330m, 360m, 400m, 440m, 480m }
        );

        public static ПолеДопуска D12 = new ПолеДопуска(ОсновноеОтклонение.D, 12,
        new decimal[] { 3m, 6m, 10m, 14m, 18m, 24m, 30m, 40m, 50m, 65m, 80m, 100m, 120m, 140m, 160m, 180m, 200m, 225m, 250m, 280m, 315m, 355m, 400m, 450m, 500m },
        new decimal[] { 120m, 150m, 190m, 230m, 230m, 275m, 275m, 330m, 330m, 400m, 400m, 470m, 470m, 545m, 545m, 545m, 630m, 630m, 630m, 710m, 710m, 780m, 780m, 860m, 860m },
        new decimal[] { 20m, 30m, 40m, 50m, 50m, 65m, 65m, 80m, 80m, 100m, 100m, 120m, 120m, 145m, 145m, 145m, 170m, 170m, 170m, 190m, 190m, 210m, 210m, 230m, 230m }
        );

        public static ПолеДопуска H18 = new ПолеДопуска(ОсновноеОтклонение.H, 18,
        new decimal[] { 6m, 10m, 14m, 18m, 24m, 30m, 40m, 50m, 65m, 80m, 100m, 120m, 140m, 160m, 180m, 200m, 225m, 250m, 280m, 315m, 355m, 400m, 450m, 500m },
        new decimal[] { 1800m, 2200m, 2700m, 2700m, 3300m, 3300m, 3900m, 3900m, 4600m, 4600m, 5400m, 5400m, 6300m, 6300m, 6300m, 7200m, 7200m, 7200m, 8100m, 8100m, 8900m, 8900m, 9700m, 9700m },
        new decimal[] { 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m }
        );

        public static ПолеДопуска h15 = new ПолеДопуска(ОсновноеОтклонение.h, 15,
        new decimal[] { 3m, 6m, 10m, 14m, 18m, 24m, 30m, 40m, 50m, 65m, 80m, 100m, 120m, 140m, 160m, 180m, 200m, 225m, 250m, 280m, 315m, 355m, 400m, 450m, 500m, 560m },
        new decimal[] { 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m },
        new decimal[] { -400m, -480m, -580m, -700m, -700m, -840m, -840m, -1000m, -1000m, -1200m, -1200m, -1400m, -1400m, -1600m, -1600m, -1600m, -1850m, -1850m, -1850m, -2100m, -2100m, -2300m, -2300m, -2500m, -2500m, -2800m }
        );

        public static ПолеДопуска c12 = new ПолеДопуска(ОсновноеОтклонение.c, 12,
        new decimal[] { 3m, 6m, 10m, 14m, 18m, 24m, 30m, 40m, 50m, 65m, 80m, 100m, 120m, 140m, 160m, 180m, 200m, 225m, 250m, 280m, 315m, 355m, 400m, 450m, 500m, 560m },
        new decimal[] { -60m, -70m, -80m, -95m, -95m, -110m, -110m, -120m, -130m, -140m, -150m, -170m, -180m, -200m, -210m, -230m, -240m, -260m, -280m, -300m, -330m, -360m, -400m, -440m, -480m, -520m },
        new decimal[] { -160m, -190m, -230m, -275m, -275m, -320m, -320m, -370m, -380m, -440m, -450m, -520m, -530m, -600m, -610m, -630m, -700m, -720m, -740m, -820m, -850m, -930m, -970m, -1070m, -1110m, -1220m }
        );

        public static ПолеДопуска x8 = new ПолеДопуска(ОсновноеОтклонение.x, 8,
        new decimal[] { 3m, 6m, 10m, 14m, 18m, 24m, 30m, 40m, 50m, 65m, 80m, 100m, 120m, 140m, 160m, 180m, 200m, 225m, 250m, 280m, 315m, 355m, 400m, 450m, 500m, 560m },
        new decimal[] { 34m, 46m, 56m, 67m, 72m, 87m, 97m, 119m, 136m, 168m, 192m, 232m, 264m, 311m, 343m, 373m, 422m, 457m, 497m, 556m, 606m, 679m, 749m, 837m, 917m, 917m },
        new decimal[] { 20m, 28m, 34m, 40m, 45m, 54m, 64m, 80m, 97m, 122m, 146m, 178m, 210m, 248m, 280m, 310m, 350m, 385m, 425m, 475m, 525m, 590m, 660m, 740m, 820m, 820m }
        );

        public static ПолеДопуска t7 = new ПолеДопуска(ОсновноеОтклонение.t, 7,
        new decimal[] { 3m, 6m, 10m, 14m, 18m, 24m, 30m, 40m, 50m, 65m, 80m, 100m, 120m, 140m, 160m, 180m, 200m, 225m, 250m, 280m, 315m, 355m, 400m, 450m, 500m, 560m },
        new decimal[] { 0m, 0m, 0m, 0m, 0m, 0m, 62m, 73m, 79m, 96m, 105m, 126m, 139m, 162m, 174m, 186m, 212m, 226m, 242m, 270m, 292m, 325m, 351m, 393m, 423m, 470m },
        new decimal[] { 0m, 0m, 0m, 0m, 0m, 0m, 41m, 48m, 54m, 66m, 75m, 91m, 104m, 122m, 134m, 146m, 166m, 180m, 196m, 218m, 240m, 268m, 294m, 330m, 360m, 400m }
        );

        public static ПолеДопуска js14 = new ПолеДопуска(ОсновноеОтклонение.js, 14,
        new decimal[] { 3m, 6m, 10m, 14m, 18m, 24m, 30m, 40m, 50m, 65m, 80m, 100m, 120m, 140m, 160m, 180m, 200m, 225m, 250m, 280m, 315m, 355m, 400m, 450m, 500m, 560m },
        new decimal[] { 125m, 150m, 180m, 215m, 215m, 260m, 260m, 310m, 310m, 370m, 370m, 435m, 435m, 500m, 500m, 500m, 575m, 575m, 575m, 650m, 650m, 700m, 700m, 775m, 775m, 870m },
        new decimal[] { -125m, -150m, -180m, -215m, -215m, -260m, -260m, -310m, -310m, -370m, -370m, -435m, -435m, -500m, -500m, -500m, -575m, -575m, -575m, -650m, -650m, -700m, -700m, -775m, -775m, -870m }
        );

        public static ПолеДопуска T6 = new ПолеДопуска(ОсновноеОтклонение.T, 6,
        new decimal[] { 3m, 6m, 10m, 14m, 18m, 24m, 30m, 40m, 50m, 65m, 80m, 100m, 120m, 140m, 160m, 180m, 200m, 225m, 250m, 280m, 315m, 355m, 400m, 450m, 500m },
        new decimal[] { 0m, 0m, 0m, 0m, 0m, 0m, -37m, -43m, -49m, -60m, -69m, -84m, -97m, -115m, -127m, -139m, -157m, -171m, -187m, -209m, -231m, -257m, -283m, -317m, -347m },
        new decimal[] { 0m, 0m, 0m, 0m, 0m, 0m, -50m, -59m, -65m, -79m, -88m, -106m, -119m, -140m, -152m, -164m, -186m, -200m, -216m, -241m, -263m, -293m, -319m, -357m, -387m }
        );

        public static ПолеДопуска h12 = new ПолеДопуска(ОсновноеОтклонение.h, 12,
        new decimal[] { 3m, 6m, 10m, 14m, 18m, 24m, 30m, 40m, 50m, 65m, 80m, 100m, 120m, 140m, 160m, 180m, 200m, 225m, 250m, 280m, 315m, 355m, 400m, 450m, 500m, 560m },
        new decimal[] { 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m },
        new decimal[] { -100m, -120m, -150m, -180m, -180m, -210m, -210m, -250m, -250m, -300m, -300m, -350m, -350m, -400m, -400m, -400m, -460m, -460m, -460m, -520m, -520m, -570m, -570m, -630m, -630m, -700m }
        );

        public static ПолеДопуска s5 = new ПолеДопуска(ОсновноеОтклонение.s, 5,
        new decimal[] { 3m, 6m, 10m, 14m, 18m, 24m, 30m, 40m, 50m, 65m, 80m, 100m, 120m, 140m, 160m, 180m, 200m, 225m, 250m, 280m, 315m, 355m, 400m, 450m, 500m, 560m },
        new decimal[] { 18m, 24m, 29m, 36m, 36m, 44m, 44m, 54m, 54m, 66m, 72m, 86m, 94m, 110m, 118m, 126m, 142m, 150m, 160m, 181m, 193m, 215m, 233m, 259m, 279m, 310m },
        new decimal[] { 14m, 19m, 23m, 28m, 28m, 35m, 35m, 43m, 43m, 53m, 59m, 71m, 79m, 92m, 100m, 108m, 122m, 130m, 140m, 158m, 170m, 190m, 208m, 232m, 252m, 280m }
        );

        public static ПолеДопуска j6 = new ПолеДопуска(ОсновноеОтклонение.j, 6,
        new decimal[] { 3m, 6m, 10m, 14m, 18m, 24m, 30m, 40m, 50m, 65m, 80m, 100m, 120m, 140m, 160m, 180m, 200m, 225m, 250m, 280m, 315m, 355m, 400m, 450m, 500m, 560m },
        new decimal[] { 4m, 6m, 7m, 8m, 8m, 9m, 9m, 11m, 11m, 12m, 12m, 13m, 13m, 14m, 14m, 14m, 16m, 16m, 16m, 16m, 16m, 18m, 18m, 20m, 20m, 20m },
        new decimal[] { -2m, -2m, -2m, -3m, -3m, -4m, -4m, -5m, -5m, -7m, -7m, -9m, -9m, -11m, -11m, -11m, -13m, -13m, -13m, -16m, -16m, -18m, -18m, -20m, -20m, -20m }
        );

        public static ПолеДопуска b12 = new ПолеДопуска(ОсновноеОтклонение.b, 12,
        new decimal[] { 3m, 6m, 10m, 14m, 18m, 24m, 30m, 40m, 50m, 65m, 80m, 100m, 120m, 140m, 160m, 180m, 200m, 225m, 250m, 280m, 315m, 355m, 400m, 450m, 500m, 560m },
        new decimal[] { -140m, -140m, -150m, -150m, -150m, -160m, -160m, -170m, -180m, -190m, -200m, -220m, -240m, -260m, -280m, -310m, -340m, -380m, -420m, -480m, -540m, -600m, -680m, -760m, -840m, -840m },
        new decimal[] { -240m, -260m, -300m, -330m, -330m, -370m, -370m, -420m, -430m, -490m, -500m, -570m, -590m, -660m, -680m, -710m, -800m, -840m, -880m, -1000m, -1060m, -1170m, -1250m, -1390m, -1470m, -1470m }
        );

        public static ПолеДопуска ef6 = new ПолеДопуска(ОсновноеОтклонение.ef, 6,
        new decimal[] { 3m, 6m, 10m },
        new decimal[] { -10m, -14m, -18m },
        new decimal[] { -16m, -22m, -27m }
        );

        public static ПолеДопуска d12 = new ПолеДопуска(ОсновноеОтклонение.d, 12,
        new decimal[] { 3m, 6m, 10m, 14m, 18m, 24m, 30m, 40m, 50m, 65m, 80m, 100m, 120m, 140m, 160m, 180m, 200m, 225m, 250m, 280m, 315m, 355m, 400m, 450m, 500m, 560m },
        new decimal[] { -20m, -30m, -40m, -50m, -50m, -65m, -65m, -80m, -80m, -100m, -100m, -120m, -120m, -145m, -145m, -170m, -170m, -170m, -170m, -190m, -190m, -210m, -210m, -230m, -230m, -260m },
        new decimal[] { -120m, -150m, -190m, -230m, -230m, -275m, -275m, -330m, -330m, -400m, -400m, -470m, -470m, -545m, -545m, -630m, -630m, -630m, -630m, -710m, -710m, -780m, -780m, -860m, -860m, -960m }
        );

        public static ПолеДопуска h18 = new ПолеДопуска(ОсновноеОтклонение.h, 18,
        new decimal[] { 6m, 10m, 14m, 18m, 24m, 30m, 40m, 40m, 65m, 80m, 100m, 120m, 140m, 160m, 180m, 200m, 225m, 250m, 280m, 315m, 355m, 400m, 450m, 500m },
        new decimal[] { 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m },
        new decimal[] { -1800m, -2200m, -2700m, -2700m, -3300m, -3300m, -3900m, -3900m, -4600m, -4600m, -5400m, -5400m, -6300m, -6300m, -6300m, -7200m, -7200m, -7200m, -8100m, -8100m, -8900m, -8900m, -9700m, -9700m }
        );

        public static ПолеДопуска JS12 = new ПолеДопуска(ОсновноеОтклонение.JS, 12,
        new decimal[] { 3m, 6m, 10m, 14m, 18m, 24m, 30m, 40m, 50m, 65m, 80m, 100m, 120m, 140m, 160m, 180m, 200m, 225m, 250m, 280m, 315m, 355m, 400m, 450m, 500m },
        new decimal[] { 50m, 60m, 75m, 90m, 90m, 105m, 105m, 125m, 125m, 150m, 150m, 175m, 175m, 200m, 200m, 200m, 230m, 230m, 230m, 260m, 260m, 285m, 285m, 315m, 315m },
        new decimal[] { -50m, -60m, -75m, -90m, -90m, -105m, -105m, -125m, -125m, -150m, -150m, -175m, -175m, -200m, -200m, -200m, -230m, -230m, -230m, -260m, -260m, -285m, -285m, -315m, -315m }
        );

        public static ПолеДопуска t8 = new ПолеДопуска(ОсновноеОтклонение.t, 8,
        new decimal[] { 560m },
        new decimal[] { 510m },
        new decimal[] { 400m }
        );

        public static ПолеДопуска v6 = new ПолеДопуска(ОсновноеОтклонение.v, 6,
        new decimal[] { 3m, 6m, 10m, 14m, 18m, 24m, 30m, 40m, 50m, 65m, 80m, 100m, 120m, 140m, 160m, 180m, 200m, 225m, 250m, 280m, 315m, 355m, 400m, 450m, 500m, 560m },
        new decimal[] { 0m, 0m, 0m, 0m, 50m, 60m, 68m, 84m, 97m, 121m, 139m, 168m, 194m, 227m, 253m, 277m, 313m, 339m, 369m, 417m, 457m, 511m, 566m, 635m, 700m, 784m },
        new decimal[] { 0m, 0m, 0m, 0m, 39m, 47m, 55m, 68m, 81m, 102m, 120m, 146m, 172m, 202m, 228m, 252m, 284m, 310m, 340m, 385m, 425m, 475m, 530m, 595m, 660m, 740m }
        );

        public static ПолеДопуска js17 = new ПолеДопуска(ОсновноеОтклонение.js, 17,
        new decimal[] { 3m, 6m, 10m, 14m, 18m, 24m, 24m, 40m, 50m, 65m, 80m, 100m, 120m, 140m, 160m, 180m, 200m, 225m, 250m, 280m, 315m, 355m, 400m, 450m, 500m },
        new decimal[] { 500m, 600m, 750m, 900m, 900m, 1050m, 1050m, 1250m, 1250m, 1500m, 1500m, 1750m, 1750m, 2000m, 2000m, 2000m, 2300m, 2300m, 2300m, 2600m, 2600m, 2850m, 2850m, 3150m, 3150m },
        new decimal[] { -500m, -600m, -750m, -900m, -900m, -1050m, -1050m, -1250m, -1250m, -1500m, -1500m, -1750m, -1750m, -2000m, -2000m, -2000m, -2300m, -2300m, -2300m, -2600m, -2600m, -2850m, -2850m, -3150m, -3150m }
        );

        public static ПолеДопуска H4 = new ПолеДопуска(ОсновноеОтклонение.H, 4,
        new decimal[] { 3m, 6m, 10m, 14m, 18m, 24m, 30m, 40m, 50m, 65m, 80m, 100m, 120m, 140m, 160m, 180m, 200m, 225m, 250m, 280m, 315m, 355m, 400m, 450m, 500m },
        new decimal[] { 3m, 4m, 4m, 5m, 5m, 6m, 6m, 7m, 7m, 8m, 8m, 10m, 10m, 12m, 12m, 12m, 14m, 14m, 14m, 16m, 16m, 18m, 18m, 20m, 20m },
        new decimal[] { 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m }
        );

        public static ПолеДопуска H17 = new ПолеДопуска(ОсновноеОтклонение.H, 17,
        new decimal[] { 3m, 6m, 10m, 14m, 18m, 24m, 30m, 40m, 50m, 65m, 80m, 100m, 120m, 140m, 160m, 180m, 200m, 225m, 250m, 280m, 315m, 355m, 400m, 450m, 500m },
        new decimal[] { 1000m, 1200m, 1500m, 1800m, 1800m, 2100m, 2100m, 2500m, 2500m, 3000m, 3000m, 3500m, 3500m, 4000m, 4000m, 4000m, 4600m, 4600m, 4600m, 5200m, 5200m, 5700m, 5700m, 6300m, 6300m },
        new decimal[] { 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m, 0m }
        );

        public static ПолеДопуска fg6 = new ПолеДопуска(ОсновноеОтклонение.fg, 6,
        new decimal[] { 3m, 6m, 10m },
        new decimal[] { -4m, -6m, -8m },
        new decimal[] { -10m, -14m, -17m }
        );

        public static ПолеДопуска JS6 = new ПолеДопуска(ОсновноеОтклонение.JS, 6,
        new decimal[] { 3m, 6m, 10m, 14m, 18m, 30m, 40m, 50m, 65m, 80m, 100m, 120m, 140m, 160m, 180m, 200m, 225m, 250m, 280m, 315m, 355m, 400m, 450m, 500m },
        new decimal[] { 3m, 4m, 4.5m, 5.5m, 5.5m, 6.5m, 8m, 8m, 9.5m, 9.5m, 11m, 11m, 12.5m, 12.5m, 12.5m, 14.5m, 14.5m, 14.5m, 16m, 16m, 18m, 18m, 20m, 20m },
        new decimal[] { -3m, -4m, -4.5m, -5.5m, -5.5m, -6.5m, -8m, -8m, -9.5m, -9.5m, -11m, -11m, -12.5m, -12.5m, -12.5m, -14.5m, -14.5m, -14.5m, -16m, -16m, -18m, -18m, -20m, -20m }
        );


        /*

        public static ПолеДопуска[] Все = { H4, H5, H6, H7, H8, H9, H10, H11, H12,
                                            g4, h4, js4, k4, m4, g5, h5, js5, k5,
                                            m5, n5, f6, g6, h6, js6, k6, m6, n6,
                                            e7, f7, h7, js7, k7
                                          };*/
    }
}
